{
    "yellow": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "crystal": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "emerald": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 45,
                "name": "growl",
                "power": null,
                "accuracy": 100,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user growls in an endearing way, making\nopposing Pokémon less wary. This lowers their\nAttack stats.",
                "effect": "Lowers the target's Attack by one stage.",
                "level": 1
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 7
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 13
            },
            {
                "id": 24,
                "name": "double-kick",
                "power": 30,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is quickly kicked twice in succession\nusing both feet.",
                "effect": "Inflicts regular damage.  Hits twice in one turn.",
                "level": 16
            },
            {
                "id": 64,
                "name": "peck",
                "power": 35,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The target is jabbed with a sharply pointed beak\nor horn.",
                "effect": "Inflicts regular damage.",
                "level": 17
            },
            {
                "id": 28,
                "name": "sand-attack",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ground",
                "damage_class": "status",
                "description": "Sand is hurled in the target’s face, reducing the\ntarget’s accuracy.",
                "effect": "Lowers the target's accuracy by one stage.",
                "level": 21
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "level": 28
            },
            {
                "id": 98,
                "name": "quick-attack",
                "power": 40,
                "accuracy": 100,
                "pp": 30,
                "priority": 1,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user lunges at the target at a speed that makes\nit almost invisible. This move always goes first.",
                "effect": "Inflicts regular damage.",
                "level": 32
            },
            {
                "id": 163,
                "name": "slash",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is attacked with a slash of claws or\nblades. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "level": 39
            },
            {
                "id": 119,
                "name": "mirror-move",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Uses the last move targeted at the user by a Pokémon still on the field.  A move counts as targeting the user even if it hit multiple Pokémon, as long as the user was one of them; however, moves targeting the field itself do not count.  If the user has not been targeted by an appropriate move since entering the field, or if no Pokémon that targeted the user remains on the field, this move will fail.\n\nMoves that failed, missed, had no effect, or were blocked are still copied.\n\nAssist moves, time-delayed moves, “meta” moves that operate on other moves/Pokémon/abilities, and some other special moves cannot be copied and are ignored; if the last move to hit the user was such a move, the previous move will be used instead.  The full list of ignored moves is: acid armor, acupressure, after you, agility, ally switch, amnesia, aqua ring, aromatherapy, aromatic mist, assist, autotomize, barrier, baton pass, belch, belly drum, bide, bulk up, calm mind, camouflage, celebrate, charge, coil, conversion, conversion 2, copycat, cosmic power, cotton guard, counter, crafty shield, curse, defend order, defense curl, destiny bond, detect, doom desire, double team, dragon dance, electric terrain, endure, final gambit, flower shield, focus energy, focus punch, follow me, future sight, geomancy, grassy terrain, gravity, growth, grudge, guard split, hail, happy hour, harden, haze, heal bell, heal order, heal pulse, healing wish, helping hand, hold hands, hone claws, howl, imprison, ingrain, ion deluge, iron defense, kings shield, light screen, lucky chant, lunar dance, magic coat, magnet rise, magnetic flux, mat block, me first, meditate, metronome, milk drink, mimic, minimize, mirror coat, mirror move, mist, misty terrain, moonlight, morning sun, mud sport, nasty plot, nature power, perish song, power split, power trick, protect, psych up, quick guard, quiver dance, rage powder, rain dance, recover, recycle, reflect, reflect type, refresh, rest, rock polish, role play, roost, rototiller, safeguard, sandstorm, shadow blast, shadow bolt, shadow half, shadow rush, shadow shed, shadow sky, shadow storm, shadow wave, sharpen, shell smash, shift gear, sketch, slack off, sleep talk, snatch, soft boiled, spikes, spiky shield, spit up, splash, stealth rock, sticky web, stockpile, struggle, substitute, sunny day, swallow, swords dance, synthesis, tail glow, tailwind, teleport, toxic spikes, transform, water sport, wide guard, wish, withdraw and work up.\n\nThis move cannot be selected by assist, metronome, or sleep talk, nor forced by encore.",
                "level": 43
            },
            {
                "id": 327,
                "name": "sky-uppercut",
                "power": 85,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.\n\nThis move can hit Pokémon under the effect of bounce, fly, or sky drop.",
                "level": 50
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 5,
                "name": "mega-punch",
                "power": 80,
                "accuracy": 85,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is slugged by a punch thrown with\nmuscle-packed power.",
                "effect": "Inflicts regular damage."
            },
            {
                "id": 7,
                "name": "fire-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The target is punched with a fiery fist. This may also\nleave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 9,
                "name": "thunder-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "physical",
                "description": "The target is punched with an electrified fist.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target."
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages."
            },
            {
                "id": 25,
                "name": "mega-kick",
                "power": 120,
                "accuracy": 75,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is attacked by a kick launched with\nmuscle-packed power.",
                "effect": "Inflicts regular damage."
            },
            {
                "id": 34,
                "name": "body-slam",
                "power": 85,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user drops onto the target with its full body\nweight. This may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target."
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil."
            },
            {
                "id": 68,
                "name": "counter",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": -5,
                "type": "fighting",
                "damage_class": "physical",
                "description": "A retaliation move that counters any physical attack,\ninflicting double the damage taken.",
                "effect": "Targets the last opposing Pokémon to hit the user with a physical move this turn.  Inflicts twice the damage that move did to the user.  If there is no eligible target, this move will fail.  Type immunity applies, but other type effects are ignored.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 69,
                "name": "seismic-toss",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is thrown using the power of gravity.\nIt inflicts damage equal to the user’s level.",
                "effect": "Inflicts damage equal to the user's level.  Type immunity applies, but other type effects are ignored."
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore."
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers."
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal."
            },
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 189,
                "name": "mud-slap",
                "power": 20,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "special",
                "description": "The user hurls mud in the target’s face to inflict\ndamage and lower its accuracy.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's accuracy by one stage."
            },
            {
                "id": 203,
                "name": "endure",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "The user endures any attack with at least 1 HP.\nIts chance of failing rises if it is used in succession.",
                "effect": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied."
            },
            {
                "id": 210,
                "name": "fury-cutter",
                "power": 40,
                "accuracy": 95,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "The target is slashed with scythes or claws. This\nattack becomes more powerful if it hits\nin succession.",
                "effect": "Inflicts regular damage.  Power doubles after every time this move is used, whether consecutively or not, maxing out at 16x.  If this move misses or the user leaves the field, power resets."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 223,
                "name": "dynamic-punch",
                "power": 100,
                "accuracy": 50,
                "pp": 5,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user punches the target with full, concentrated\npower. This confuses the target if it hits.",
                "effect": "Inflicts regular damage.  Has a 100% chance to confuse the target."
            }
        ],
        "machine": [
            {
                "id": 15,
                "name": "cut",
                "power": 50,
                "accuracy": 95,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is cut with a scythe or claw.",
                "effect": "Inflicts regular damage.",
                "machine": "hm01"
            },
            {
                "id": 70,
                "name": "strength",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is slugged with a punch thrown at\nmaximum power.",
                "effect": "Inflicts regular damage.",
                "machine": "hm04"
            },
            {
                "id": 249,
                "name": "rock-smash",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a punch. This may also lower\nthe target’s Defense stat.",
                "effect": "Inflicts regular damage.  Has a 50% chance to lower the target's Defense by one stage.",
                "machine": "hm06"
            },
            {
                "id": 264,
                "name": "focus-punch",
                "power": 150,
                "accuracy": 100,
                "pp": 20,
                "priority": -3,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user focuses its mind before launching a punch.\nThis move fails if the user is hit before it is used.",
                "effect": "Inflicts regular damage.  If the user takes damage this turn before hitting, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm01"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "machine": "tm08"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 91,
                "name": "dig",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user burrows into the ground, then attacks on\nthe next turn.",
                "effect": "Inflicts regular damage.  User digs underground for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, earthquake, fissure, and magnitude still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm28"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 53,
                "name": "flamethrower",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is scorched with an intense blast of fire.\nThis may also leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm35"
            },
            {
                "id": 126,
                "name": "fire-blast",
                "power": 110,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with an intense blast of\nall-consuming fire. This may also leave the target\nwith a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm38"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 290,
                "name": "secret-power",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyzes target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyzes target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyzes target\nNeon           | Paralyzes target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 315,
                "name": "overheat",
                "power": 130,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks the target at full power. The attack’s\nrecoil harshly lowers the user’s Sp. Atk stat.",
                "effect": "Inflicts regular damage, then lowers the user's Special Attack by two stages.",
                "machine": "tm50"
            }
        ]
    },
    "platinum": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 45,
                "name": "growl",
                "power": null,
                "accuracy": 100,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user growls in an endearing way, making\nopposing Pokémon less wary. This lowers their\nAttack stats.",
                "effect": "Lowers the target's Attack by one stage.",
                "level": 1
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 7
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 13
            },
            {
                "id": 24,
                "name": "double-kick",
                "power": 30,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is quickly kicked twice in succession\nusing both feet.",
                "effect": "Inflicts regular damage.  Hits twice in one turn.",
                "level": 16
            },
            {
                "id": 64,
                "name": "peck",
                "power": 35,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The target is jabbed with a sharply pointed beak\nor horn.",
                "effect": "Inflicts regular damage.",
                "level": 17
            },
            {
                "id": 28,
                "name": "sand-attack",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ground",
                "damage_class": "status",
                "description": "Sand is hurled in the target’s face, reducing the\ntarget’s accuracy.",
                "effect": "Lowers the target's accuracy by one stage.",
                "level": 21
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "level": 28
            },
            {
                "id": 98,
                "name": "quick-attack",
                "power": 40,
                "accuracy": 100,
                "pp": 30,
                "priority": 1,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user lunges at the target at a speed that makes\nit almost invisible. This move always goes first.",
                "effect": "Inflicts regular damage.",
                "level": 32
            },
            {
                "id": 163,
                "name": "slash",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is attacked with a slash of claws or\nblades. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "level": 39
            },
            {
                "id": 119,
                "name": "mirror-move",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Uses the last move targeted at the user by a Pokémon still on the field.  A move counts as targeting the user even if it hit multiple Pokémon, as long as the user was one of them; however, moves targeting the field itself do not count.  If the user has not been targeted by an appropriate move since entering the field, or if no Pokémon that targeted the user remains on the field, this move will fail.\n\nMoves that failed, missed, had no effect, or were blocked are still copied.\n\nAssist moves, time-delayed moves, “meta” moves that operate on other moves/Pokémon/abilities, and some other special moves cannot be copied and are ignored; if the last move to hit the user was such a move, the previous move will be used instead.  The full list of ignored moves is: acid armor, acupressure, after you, agility, ally switch, amnesia, aqua ring, aromatherapy, aromatic mist, assist, autotomize, barrier, baton pass, belch, belly drum, bide, bulk up, calm mind, camouflage, celebrate, charge, coil, conversion, conversion 2, copycat, cosmic power, cotton guard, counter, crafty shield, curse, defend order, defense curl, destiny bond, detect, doom desire, double team, dragon dance, electric terrain, endure, final gambit, flower shield, focus energy, focus punch, follow me, future sight, geomancy, grassy terrain, gravity, growth, grudge, guard split, hail, happy hour, harden, haze, heal bell, heal order, heal pulse, healing wish, helping hand, hold hands, hone claws, howl, imprison, ingrain, ion deluge, iron defense, kings shield, light screen, lucky chant, lunar dance, magic coat, magnet rise, magnetic flux, mat block, me first, meditate, metronome, milk drink, mimic, minimize, mirror coat, mirror move, mist, misty terrain, moonlight, morning sun, mud sport, nasty plot, nature power, perish song, power split, power trick, protect, psych up, quick guard, quiver dance, rage powder, rain dance, recover, recycle, reflect, reflect type, refresh, rest, rock polish, role play, roost, rototiller, safeguard, sandstorm, shadow blast, shadow bolt, shadow half, shadow rush, shadow shed, shadow sky, shadow storm, shadow wave, sharpen, shell smash, shift gear, sketch, slack off, sleep talk, snatch, soft boiled, spikes, spiky shield, spit up, splash, stealth rock, sticky web, stockpile, struggle, substitute, sunny day, swallow, swords dance, synthesis, tail glow, tailwind, teleport, toxic spikes, transform, water sport, wide guard, wish, withdraw and work up.\n\nThis move cannot be selected by assist, metronome, or sleep talk, nor forced by encore.",
                "level": 43
            },
            {
                "id": 327,
                "name": "sky-uppercut",
                "power": 85,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.\n\nThis move can hit Pokémon under the effect of bounce, fly, or sky drop.",
                "level": 50
            },
            {
                "id": 394,
                "name": "flare-blitz",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The user cloaks itself in fire and charges the target.\nThis also damages the user quite a lot. This attack\nmay leave the target with a burn.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.  Has a 10% chance to burn the target.  Frozen Pokémon may use this move, in which case they will thaw.",
                "level": 54
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 7,
                "name": "fire-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The target is punched with a fiery fist. This may also\nleave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 9,
                "name": "thunder-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "physical",
                "description": "The target is punched with an electrified fist.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target."
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers."
            },
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 189,
                "name": "mud-slap",
                "power": 20,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "special",
                "description": "The user hurls mud in the target’s face to inflict\ndamage and lower its accuracy.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's accuracy by one stage."
            },
            {
                "id": 210,
                "name": "fury-cutter",
                "power": 40,
                "accuracy": 95,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "The target is slashed with scythes or claws. This\nattack becomes more powerful if it hits\nin succession.",
                "effect": "Inflicts regular damage.  Power doubles after every time this move is used, whether consecutively or not, maxing out at 16x.  If this move misses or the user leaves the field, power resets."
            },
            {
                "id": 257,
                "name": "heat-wave",
                "power": 95,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks by exhaling hot breath on opposing\nPokémon. This may also leave those Pokémon with\na burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 340,
                "name": "bounce",
                "power": 85,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user bounces up high, then drops on the target\non the second turn. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  User bounces high into the air for one turn, becoming immune to attack, and hits on the second turn.  Has a 30% chance to paralyze the target.\n\nDuring the immune turn, gust, hurricane, sky uppercut, smack down, thunder, and twister still hit the user normally.  gust and twister also have double power against the user.\n\nThe damage from hail and sandstorm still applies during the immune turn.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be used while gravity is in effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail."
            },
            {
                "id": 410,
                "name": "vacuum-wave",
                "power": 40,
                "accuracy": 100,
                "pp": 30,
                "priority": 1,
                "type": "fighting",
                "damage_class": "special",
                "description": "The user whirls its fists to send a wave of pure\nvacuum at the target. This move always goes first.",
                "effect": "Inflicts regular damage."
            }
        ],
        "machine": [
            {
                "id": 15,
                "name": "cut",
                "power": 50,
                "accuracy": 95,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is cut with a scythe or claw.",
                "effect": "Inflicts regular damage.",
                "machine": "hm01"
            },
            {
                "id": 70,
                "name": "strength",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is slugged with a punch thrown at\nmaximum power.",
                "effect": "Inflicts regular damage.",
                "machine": "hm04"
            },
            {
                "id": 249,
                "name": "rock-smash",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a punch. This may also lower\nthe target’s Defense stat.",
                "effect": "Inflicts regular damage.  Has a 50% chance to lower the target's Defense by one stage.",
                "machine": "hm06"
            },
            {
                "id": 264,
                "name": "focus-punch",
                "power": 150,
                "accuracy": 100,
                "pp": 20,
                "priority": -3,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user focuses its mind before launching a punch.\nThis move fails if the user is hit before it is used.",
                "effect": "Inflicts regular damage.  If the user takes damage this turn before hitting, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm01"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "machine": "tm08"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 91,
                "name": "dig",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user burrows into the ground, then attacks on\nthe next turn.",
                "effect": "Inflicts regular damage.  User digs underground for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, earthquake, fissure, and magnitude still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm28"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 53,
                "name": "flamethrower",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is scorched with an intense blast of fire.\nThis may also leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm35"
            },
            {
                "id": 126,
                "name": "fire-blast",
                "power": 110,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with an intense blast of\nall-consuming fire. This may also leave the target\nwith a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm38"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 290,
                "name": "secret-power",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyzes target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyzes target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyzes target\nNeon           | Paralyzes target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 315,
                "name": "overheat",
                "power": 130,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks the target at full power. The attack’s\nrecoil harshly lowers the user’s Sp. Atk stat.",
                "effect": "Inflicts regular damage, then lowers the user's Special Attack by two stages.",
                "machine": "tm50"
            },
            {
                "id": 411,
                "name": "focus-blast",
                "power": 120,
                "accuracy": 70,
                "pp": 5,
                "priority": 0,
                "type": "fighting",
                "damage_class": "special",
                "description": "The user heightens its mental focus and unleashes\nits power. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm52"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 203,
                "name": "endure",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "The user endures any attack with at least 1 HP.\nIts chance of failing rises if it is used in succession.",
                "effect": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm58"
            },
            {
                "id": 261,
                "name": "will-o-wisp",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user shoots a sinister flame at the target to inflict\na burn.",
                "effect": "Burns the target.",
                "machine": "tm61"
            },
            {
                "id": 421,
                "name": "shadow-claw",
                "power": 70,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "physical",
                "description": "The user slashes with a sharp claw made from\nshadows. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "machine": "tm65"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 445,
                "name": "captivate",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's Special Attack by two stages.  If the user and target are the same gender, or either is genderless, this move will fail.",
                "machine": "tm78"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm82"
            },
            {
                "id": 363,
                "name": "natural-gift",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held berry.  The berry is consumed.  If the user is not holding a berry, this move will fail.",
                "machine": "tm83"
            },
            {
                "id": 398,
                "name": "poison-jab",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "poison",
                "damage_class": "physical",
                "description": "The target is stabbed with a tentacle, arm, or the like\nsteeped in poison. This may also poison the target.",
                "effect": "Inflicts regular damage.  Has a 30% chance to poison the target.",
                "machine": "tm84"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            }
        ]
    },
    "black-2-white-2": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 45,
                "name": "growl",
                "power": null,
                "accuracy": 100,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user growls in an endearing way, making\nopposing Pokémon less wary. This lowers their\nAttack stats.",
                "effect": "Lowers the target's Attack by one stage.",
                "level": 1
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 7
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 13
            },
            {
                "id": 24,
                "name": "double-kick",
                "power": 30,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is quickly kicked twice in succession\nusing both feet.",
                "effect": "Inflicts regular damage.  Hits twice in one turn.",
                "level": 16
            },
            {
                "id": 64,
                "name": "peck",
                "power": 35,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The target is jabbed with a sharply pointed beak\nor horn.",
                "effect": "Inflicts regular damage.",
                "level": 17
            },
            {
                "id": 28,
                "name": "sand-attack",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ground",
                "damage_class": "status",
                "description": "Sand is hurled in the target’s face, reducing the\ntarget’s accuracy.",
                "effect": "Lowers the target's accuracy by one stage.",
                "level": 21
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "level": 28
            },
            {
                "id": 98,
                "name": "quick-attack",
                "power": 40,
                "accuracy": 100,
                "pp": 30,
                "priority": 1,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user lunges at the target at a speed that makes\nit almost invisible. This move always goes first.",
                "effect": "Inflicts regular damage.",
                "level": 32
            },
            {
                "id": 163,
                "name": "slash",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is attacked with a slash of claws or\nblades. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "level": 39
            },
            {
                "id": 119,
                "name": "mirror-move",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Uses the last move targeted at the user by a Pokémon still on the field.  A move counts as targeting the user even if it hit multiple Pokémon, as long as the user was one of them; however, moves targeting the field itself do not count.  If the user has not been targeted by an appropriate move since entering the field, or if no Pokémon that targeted the user remains on the field, this move will fail.\n\nMoves that failed, missed, had no effect, or were blocked are still copied.\n\nAssist moves, time-delayed moves, “meta” moves that operate on other moves/Pokémon/abilities, and some other special moves cannot be copied and are ignored; if the last move to hit the user was such a move, the previous move will be used instead.  The full list of ignored moves is: acid armor, acupressure, after you, agility, ally switch, amnesia, aqua ring, aromatherapy, aromatic mist, assist, autotomize, barrier, baton pass, belch, belly drum, bide, bulk up, calm mind, camouflage, celebrate, charge, coil, conversion, conversion 2, copycat, cosmic power, cotton guard, counter, crafty shield, curse, defend order, defense curl, destiny bond, detect, doom desire, double team, dragon dance, electric terrain, endure, final gambit, flower shield, focus energy, focus punch, follow me, future sight, geomancy, grassy terrain, gravity, growth, grudge, guard split, hail, happy hour, harden, haze, heal bell, heal order, heal pulse, healing wish, helping hand, hold hands, hone claws, howl, imprison, ingrain, ion deluge, iron defense, kings shield, light screen, lucky chant, lunar dance, magic coat, magnet rise, magnetic flux, mat block, me first, meditate, metronome, milk drink, mimic, minimize, mirror coat, mirror move, mist, misty terrain, moonlight, morning sun, mud sport, nasty plot, nature power, perish song, power split, power trick, protect, psych up, quick guard, quiver dance, rage powder, rain dance, recover, recycle, reflect, reflect type, refresh, rest, rock polish, role play, roost, rototiller, safeguard, sandstorm, shadow blast, shadow bolt, shadow half, shadow rush, shadow shed, shadow sky, shadow storm, shadow wave, sharpen, shell smash, shift gear, sketch, slack off, sleep talk, snatch, soft boiled, spikes, spiky shield, spit up, splash, stealth rock, sticky web, stockpile, struggle, substitute, sunny day, swallow, swords dance, synthesis, tail glow, tailwind, teleport, toxic spikes, transform, water sport, wide guard, wish, withdraw and work up.\n\nThis move cannot be selected by assist, metronome, or sleep talk, nor forced by encore.",
                "level": 43
            },
            {
                "id": 327,
                "name": "sky-uppercut",
                "power": 85,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.\n\nThis move can hit Pokémon under the effect of bounce, fly, or sky drop.",
                "level": 50
            },
            {
                "id": 394,
                "name": "flare-blitz",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The user cloaks itself in fire and charges the target.\nThis also damages the user quite a lot. This attack\nmay leave the target with a burn.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.  Has a 10% chance to burn the target.  Frozen Pokémon may use this move, in which case they will thaw.",
                "level": 54
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 7,
                "name": "fire-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The target is punched with a fiery fist. This may also\nleave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 9,
                "name": "thunder-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "physical",
                "description": "The target is punched with an electrified fist.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target."
            },
            {
                "id": 67,
                "name": "low-kick",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "A powerful low kick that makes the target fall over.\nThe heavier the target, the greater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n"
            },
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 257,
                "name": "heat-wave",
                "power": 95,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks by exhaling hot breath on opposing\nPokémon. This may also leave those Pokémon with\na burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 340,
                "name": "bounce",
                "power": 85,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user bounces up high, then drops on the target\non the second turn. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  User bounces high into the air for one turn, becoming immune to attack, and hits on the second turn.  Has a 30% chance to paralyze the target.\n\nDuring the immune turn, gust, hurricane, sky uppercut, smack down, thunder, and twister still hit the user normally.  gust and twister also have double power against the user.\n\nThe damage from hail and sandstorm still applies during the immune turn.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be used while gravity is in effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail."
            },
            {
                "id": 519,
                "name": "fire-pledge",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "A column of fire hits the target. When used with its\ngrass equivalent, its power increases and a vast sea\nof fire appears.",
                "effect": "Inflicts regular damage.  If a friendly Pokémon used water pledge earlier this turn, moves used by any friendly Pokémon have doubled effect chance for four turns (including this one)."
            },
            {
                "id": 530,
                "name": "dual-chop",
                "power": 40,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "dragon",
                "damage_class": "physical",
                "description": "The user attacks its target by hitting it with brutal\nstrikes. The target is hit twice in a row.",
                "effect": "Inflicts regular damage.  Hits twice in one turn."
            }
        ],
        "machine": [
            {
                "id": 15,
                "name": "cut",
                "power": 50,
                "accuracy": 95,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is cut with a scythe or claw.",
                "effect": "Inflicts regular damage.",
                "machine": "hm01"
            },
            {
                "id": 70,
                "name": "strength",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is slugged with a punch thrown at\nmaximum power.",
                "effect": "Inflicts regular damage.",
                "machine": "hm04"
            },
            {
                "id": 468,
                "name": "hone-claws",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user sharpens its claws to boost its Attack stat\nand accuracy.",
                "effect": "Raises the user's Attack and accuracy by one stage.",
                "machine": "tm01"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "machine": "tm08"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 91,
                "name": "dig",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user burrows into the ground, then attacks on\nthe next turn.",
                "effect": "Inflicts regular damage.  User digs underground for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, earthquake, fissure, and magnitude still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm28"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 53,
                "name": "flamethrower",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is scorched with an intense blast of fire.\nThis may also leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm35"
            },
            {
                "id": 126,
                "name": "fire-blast",
                "power": 110,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with an intense blast of\nall-consuming fire. This may also leave the target\nwith a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm38"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 488,
                "name": "flame-charge",
                "power": 50,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "Cloaking itself in flame, the user attacks the target.\nThen, building up more power, the user raises its\nSpeed stat.",
                "effect": "Inflicts regular damage.  Raises the user's Speed by one stage.",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 490,
                "name": "low-sweep",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user makes a swift attack on the target’s legs,\nwhich lowers the target’s Speed stat.",
                "effect": "Lowers the target's Speed by one stage.",
                "machine": "tm47"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 497,
                "name": "echoed-voice",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with an echoing voice.\nIf this move is used every turn, its power\nis increased.",
                "effect": "Inflicts regular damage.  If any friendly Pokémon used this move earlier this turn or on the previous turn, that use's power is added to this move's power, to a maximum of 200.",
                "machine": "tm49"
            },
            {
                "id": 315,
                "name": "overheat",
                "power": 130,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks the target at full power. The attack’s\nrecoil harshly lowers the user’s Sp. Atk stat.",
                "effect": "Inflicts regular damage, then lowers the user's Special Attack by two stages.",
                "machine": "tm50"
            },
            {
                "id": 411,
                "name": "focus-blast",
                "power": 120,
                "accuracy": 70,
                "pp": 5,
                "priority": 0,
                "type": "fighting",
                "damage_class": "special",
                "description": "The user heightens its mental focus and unleashes\nits power. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm52"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 510,
                "name": "incinerate",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks opposing Pokémon with fire.\nIf a Pokémon is holding a certain item, such as a\nBerry, the item becomes burned up and unusable.",
                "effect": "Inflicts regular damage.  If the target is holding a berry, it's destroyed and cannot be used in response to this move.",
                "machine": "tm59"
            },
            {
                "id": 261,
                "name": "will-o-wisp",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user shoots a sinister flame at the target to inflict\na burn.",
                "effect": "Burns the target.",
                "machine": "tm61"
            },
            {
                "id": 421,
                "name": "shadow-claw",
                "power": 70,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "physical",
                "description": "The user slashes with a sharp claw made from\nshadows. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "machine": "tm65"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 526,
                "name": "work-up",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user is roused, and its Attack and Sp. Atk\nstats increase.",
                "effect": "Raises the user's Attack and Special Attack by one stage each.",
                "machine": "tm83"
            },
            {
                "id": 398,
                "name": "poison-jab",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "poison",
                "damage_class": "physical",
                "description": "The target is stabbed with a tentacle, arm, or the like\nsteeped in poison. This may also poison the target.",
                "effect": "Inflicts regular damage.  Has a 30% chance to poison the target.",
                "machine": "tm84"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 249,
                "name": "rock-smash",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a punch. This may also lower\nthe target’s Defense stat.",
                "effect": "Inflicts regular damage.  Has a 50% chance to lower the target's Defense by one stage.",
                "machine": "tm94"
            }
        ]
    },
    "x-y": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 45,
                "name": "growl",
                "power": null,
                "accuracy": 100,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user growls in an endearing way, making\nopposing Pokémon less wary. This lowers their\nAttack stats.",
                "effect": "Lowers the target's Attack by one stage.",
                "level": 1
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 1
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 7
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 13
            },
            {
                "id": 24,
                "name": "double-kick",
                "power": 30,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is quickly kicked twice in succession\nusing both feet.",
                "effect": "Inflicts regular damage.  Hits twice in one turn.",
                "level": 16
            },
            {
                "id": 64,
                "name": "peck",
                "power": 35,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The target is jabbed with a sharply pointed beak\nor horn.",
                "effect": "Inflicts regular damage.",
                "level": 17
            },
            {
                "id": 28,
                "name": "sand-attack",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ground",
                "damage_class": "status",
                "description": "Sand is hurled in the target’s face, reducing the\ntarget’s accuracy.",
                "effect": "Lowers the target's accuracy by one stage.",
                "level": 21
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "level": 28
            },
            {
                "id": 98,
                "name": "quick-attack",
                "power": 40,
                "accuracy": 100,
                "pp": 30,
                "priority": 1,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user lunges at the target at a speed that makes\nit almost invisible. This move always goes first.",
                "effect": "Inflicts regular damage.",
                "level": 32
            },
            {
                "id": 163,
                "name": "slash",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is attacked with a slash of claws or\nblades. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "level": 39
            },
            {
                "id": 119,
                "name": "mirror-move",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Uses the last move targeted at the user by a Pokémon still on the field.  A move counts as targeting the user even if it hit multiple Pokémon, as long as the user was one of them; however, moves targeting the field itself do not count.  If the user has not been targeted by an appropriate move since entering the field, or if no Pokémon that targeted the user remains on the field, this move will fail.\n\nMoves that failed, missed, had no effect, or were blocked are still copied.\n\nAssist moves, time-delayed moves, “meta” moves that operate on other moves/Pokémon/abilities, and some other special moves cannot be copied and are ignored; if the last move to hit the user was such a move, the previous move will be used instead.  The full list of ignored moves is: acid armor, acupressure, after you, agility, ally switch, amnesia, aqua ring, aromatherapy, aromatic mist, assist, autotomize, barrier, baton pass, belch, belly drum, bide, bulk up, calm mind, camouflage, celebrate, charge, coil, conversion, conversion 2, copycat, cosmic power, cotton guard, counter, crafty shield, curse, defend order, defense curl, destiny bond, detect, doom desire, double team, dragon dance, electric terrain, endure, final gambit, flower shield, focus energy, focus punch, follow me, future sight, geomancy, grassy terrain, gravity, growth, grudge, guard split, hail, happy hour, harden, haze, heal bell, heal order, heal pulse, healing wish, helping hand, hold hands, hone claws, howl, imprison, ingrain, ion deluge, iron defense, kings shield, light screen, lucky chant, lunar dance, magic coat, magnet rise, magnetic flux, mat block, me first, meditate, metronome, milk drink, mimic, minimize, mirror coat, mirror move, mist, misty terrain, moonlight, morning sun, mud sport, nasty plot, nature power, perish song, power split, power trick, protect, psych up, quick guard, quiver dance, rage powder, rain dance, recover, recycle, reflect, reflect type, refresh, rest, rock polish, role play, roost, rototiller, safeguard, sandstorm, shadow blast, shadow bolt, shadow half, shadow rush, shadow shed, shadow sky, shadow storm, shadow wave, sharpen, shell smash, shift gear, sketch, slack off, sleep talk, snatch, soft boiled, spikes, spiky shield, spit up, splash, stealth rock, sticky web, stockpile, struggle, substitute, sunny day, swallow, swords dance, synthesis, tail glow, tailwind, teleport, toxic spikes, transform, water sport, wide guard, wish, withdraw and work up.\n\nThis move cannot be selected by assist, metronome, or sleep talk, nor forced by encore.",
                "level": 43
            },
            {
                "id": 327,
                "name": "sky-uppercut",
                "power": 85,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.\n\nThis move can hit Pokémon under the effect of bounce, fly, or sky drop.",
                "level": 50
            },
            {
                "id": 394,
                "name": "flare-blitz",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The user cloaks itself in fire and charges the target.\nThis also damages the user quite a lot. This attack\nmay leave the target with a burn.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.  Has a 10% chance to burn the target.  Frozen Pokémon may use this move, in which case they will thaw.",
                "level": 54
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 519,
                "name": "fire-pledge",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "A column of fire hits the target. When used with its\ngrass equivalent, its power increases and a vast sea\nof fire appears.",
                "effect": "Inflicts regular damage.  If a friendly Pokémon used water pledge earlier this turn, moves used by any friendly Pokémon have doubled effect chance for four turns (including this one)."
            }
        ],
        "machine": [
            {
                "id": 15,
                "name": "cut",
                "power": 50,
                "accuracy": 95,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is cut with a scythe or claw.",
                "effect": "Inflicts regular damage.",
                "machine": "hm01"
            },
            {
                "id": 70,
                "name": "strength",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is slugged with a punch thrown at\nmaximum power.",
                "effect": "Inflicts regular damage.",
                "machine": "hm04"
            },
            {
                "id": 468,
                "name": "hone-claws",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user sharpens its claws to boost its Attack stat\nand accuracy.",
                "effect": "Raises the user's Attack and accuracy by one stage.",
                "machine": "tm01"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "machine": "tm08"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 91,
                "name": "dig",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user burrows into the ground, then attacks on\nthe next turn.",
                "effect": "Inflicts regular damage.  User digs underground for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, earthquake, fissure, and magnitude still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm28"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 53,
                "name": "flamethrower",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is scorched with an intense blast of fire.\nThis may also leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm35"
            },
            {
                "id": 126,
                "name": "fire-blast",
                "power": 110,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with an intense blast of\nall-consuming fire. This may also leave the target\nwith a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm38"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 488,
                "name": "flame-charge",
                "power": 50,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "Cloaking itself in flame, the user attacks the target.\nThen, building up more power, the user raises its\nSpeed stat.",
                "effect": "Inflicts regular damage.  Raises the user's Speed by one stage.",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 490,
                "name": "low-sweep",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user makes a swift attack on the target’s legs,\nwhich lowers the target’s Speed stat.",
                "effect": "Lowers the target's Speed by one stage.",
                "machine": "tm47"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 497,
                "name": "echoed-voice",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with an echoing voice.\nIf this move is used every turn, its power\nis increased.",
                "effect": "Inflicts regular damage.  If any friendly Pokémon used this move earlier this turn or on the previous turn, that use's power is added to this move's power, to a maximum of 200.",
                "machine": "tm49"
            },
            {
                "id": 315,
                "name": "overheat",
                "power": 130,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks the target at full power. The attack’s\nrecoil harshly lowers the user’s Sp. Atk stat.",
                "effect": "Inflicts regular damage, then lowers the user's Special Attack by two stages.",
                "machine": "tm50"
            },
            {
                "id": 411,
                "name": "focus-blast",
                "power": 120,
                "accuracy": 70,
                "pp": 5,
                "priority": 0,
                "type": "fighting",
                "damage_class": "special",
                "description": "The user heightens its mental focus and unleashes\nits power. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm52"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 510,
                "name": "incinerate",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks opposing Pokémon with fire.\nIf a Pokémon is holding a certain item, such as a\nBerry, the item becomes burned up and unusable.",
                "effect": "Inflicts regular damage.  If the target is holding a berry, it's destroyed and cannot be used in response to this move.",
                "machine": "tm59"
            },
            {
                "id": 261,
                "name": "will-o-wisp",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user shoots a sinister flame at the target to inflict\na burn.",
                "effect": "Burns the target.",
                "machine": "tm61"
            },
            {
                "id": 421,
                "name": "shadow-claw",
                "power": 70,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "physical",
                "description": "The user slashes with a sharp claw made from\nshadows. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "machine": "tm65"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 398,
                "name": "poison-jab",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "poison",
                "damage_class": "physical",
                "description": "The target is stabbed with a tentacle, arm, or the like\nsteeped in poison. This may also poison the target.",
                "effect": "Inflicts regular damage.  Has a 30% chance to poison the target.",
                "machine": "tm84"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 249,
                "name": "rock-smash",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a punch. This may also lower\nthe target’s Defense stat.",
                "effect": "Inflicts regular damage.  Has a 50% chance to lower the target's Defense by one stage.",
                "machine": "tm94"
            },
            {
                "id": 612,
                "name": "power-up-punch",
                "power": 40,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "Striking opponents over and over makes the user’s\nfists harder. Hitting a target raises the Attack stat.",
                "effect": "Inflicts regular damage.  Raises the user's Attack by one stage.",
                "machine": "tm98"
            }
        ]
    },
    "ultra-sun-ultra-moon": {
        "level-up": [
            {
                "id": 24,
                "name": "double-kick",
                "power": 30,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is quickly kicked twice in succession\nusing both feet.",
                "effect": "Inflicts regular damage.  Hits twice in one turn.",
                "level": 0
            },
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 24,
                "name": "double-kick",
                "power": 30,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The target is quickly kicked twice in succession\nusing both feet.",
                "effect": "Inflicts regular damage.  Hits twice in one turn.",
                "level": 1
            },
            {
                "id": 28,
                "name": "sand-attack",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ground",
                "damage_class": "status",
                "description": "Sand is hurled in the target’s face, reducing the\ntarget’s accuracy.",
                "effect": "Lowers the target's accuracy by one stage.",
                "level": 1
            },
            {
                "id": 45,
                "name": "growl",
                "power": null,
                "accuracy": 100,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user growls in an endearing way, making\nopposing Pokémon less wary. This lowers their\nAttack stats.",
                "effect": "Lowers the target's Attack by one stage.",
                "level": 1
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 1
            },
            {
                "id": 52,
                "name": "ember",
                "power": 40,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with small flames. This may\nalso leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "level": 5
            },
            {
                "id": 28,
                "name": "sand-attack",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ground",
                "damage_class": "status",
                "description": "Sand is hurled in the target’s face, reducing the\ntarget’s accuracy.",
                "effect": "Lowers the target's accuracy by one stage.",
                "level": 10
            },
            {
                "id": 64,
                "name": "peck",
                "power": 35,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The target is jabbed with a sharply pointed beak\nor horn.",
                "effect": "Inflicts regular damage.",
                "level": 14
            },
            {
                "id": 488,
                "name": "flame-charge",
                "power": 50,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "Cloaking itself in flame, the user attacks the target.\nThen, building up more power, the user raises its\nSpeed stat.",
                "effect": "Inflicts regular damage.  Raises the user's Speed by one stage.",
                "level": 20
            },
            {
                "id": 98,
                "name": "quick-attack",
                "power": 40,
                "accuracy": 100,
                "pp": 30,
                "priority": 1,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user lunges at the target at a speed that makes\nit almost invisible. This move always goes first.",
                "effect": "Inflicts regular damage.",
                "level": 25
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "level": 31
            },
            {
                "id": 116,
                "name": "focus-energy",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user takes a deep breath and focuses so that\ncritical hits land more easily.",
                "effect": "User's critical hit rate is two levels higher until it leaves the field.  If the user has already used focus energy since entering the field, this move will fail.\n\nThis effect is passed on by baton pass.",
                "level": 36
            },
            {
                "id": 163,
                "name": "slash",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is attacked with a slash of claws or\nblades. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "level": 42
            },
            {
                "id": 119,
                "name": "mirror-move",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Uses the last move targeted at the user by a Pokémon still on the field.  A move counts as targeting the user even if it hit multiple Pokémon, as long as the user was one of them; however, moves targeting the field itself do not count.  If the user has not been targeted by an appropriate move since entering the field, or if no Pokémon that targeted the user remains on the field, this move will fail.\n\nMoves that failed, missed, had no effect, or were blocked are still copied.\n\nAssist moves, time-delayed moves, “meta” moves that operate on other moves/Pokémon/abilities, and some other special moves cannot be copied and are ignored; if the last move to hit the user was such a move, the previous move will be used instead.  The full list of ignored moves is: acid armor, acupressure, after you, agility, ally switch, amnesia, aqua ring, aromatherapy, aromatic mist, assist, autotomize, barrier, baton pass, belch, belly drum, bide, bulk up, calm mind, camouflage, celebrate, charge, coil, conversion, conversion 2, copycat, cosmic power, cotton guard, counter, crafty shield, curse, defend order, defense curl, destiny bond, detect, doom desire, double team, dragon dance, electric terrain, endure, final gambit, flower shield, focus energy, focus punch, follow me, future sight, geomancy, grassy terrain, gravity, growth, grudge, guard split, hail, happy hour, harden, haze, heal bell, heal order, heal pulse, healing wish, helping hand, hold hands, hone claws, howl, imprison, ingrain, ion deluge, iron defense, kings shield, light screen, lucky chant, lunar dance, magic coat, magnet rise, magnetic flux, mat block, me first, meditate, metronome, milk drink, mimic, minimize, mirror coat, mirror move, mist, misty terrain, moonlight, morning sun, mud sport, nasty plot, nature power, perish song, power split, power trick, protect, psych up, quick guard, quiver dance, rage powder, rain dance, recover, recycle, reflect, reflect type, refresh, rest, rock polish, role play, roost, rototiller, safeguard, sandstorm, shadow blast, shadow bolt, shadow half, shadow rush, shadow shed, shadow sky, shadow storm, shadow wave, sharpen, shell smash, shift gear, sketch, slack off, sleep talk, snatch, soft boiled, spikes, spiky shield, spit up, splash, stealth rock, sticky web, stockpile, struggle, substitute, sunny day, swallow, swords dance, synthesis, tail glow, tailwind, teleport, toxic spikes, transform, water sport, wide guard, wish, withdraw and work up.\n\nThis move cannot be selected by assist, metronome, or sleep talk, nor forced by encore.",
                "level": 47
            },
            {
                "id": 327,
                "name": "sky-uppercut",
                "power": 85,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.\n\nThis move can hit Pokémon under the effect of bounce, fly, or sky drop.",
                "level": 53
            },
            {
                "id": 394,
                "name": "flare-blitz",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The user cloaks itself in fire and charges the target.\nThis also damages the user quite a lot. This attack\nmay leave the target with a burn.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.  Has a 10% chance to burn the target.  Frozen Pokémon may use this move, in which case they will thaw.",
                "level": 58
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 519,
                "name": "fire-pledge",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "A column of fire hits the target. When used with its\ngrass equivalent, its power increases and a vast sea\nof fire appears.",
                "effect": "Inflicts regular damage.  If a friendly Pokémon used water pledge earlier this turn, moves used by any friendly Pokémon have doubled effect chance for four turns (including this one)."
            }
        ],
        "machine": [
            {
                "id": 526,
                "name": "work-up",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user is roused, and its Attack and Sp. Atk\nstats increase.",
                "effect": "Raises the user's Attack and Special Attack by one stage each.",
                "machine": "tm01"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 339,
                "name": "bulk-up",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "status",
                "description": "The user tenses its muscles to bulk up its body,\nraising both its Attack and Defense stats.",
                "effect": "Raises the user's Attack and Defense by one stage each.",
                "machine": "tm08"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 53,
                "name": "flamethrower",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is scorched with an intense blast of fire.\nThis may also leave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm35"
            },
            {
                "id": 126,
                "name": "fire-blast",
                "power": 110,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The target is attacked with an intense blast of\nall-consuming fire. This may also leave the target\nwith a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target.",
                "machine": "tm38"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 488,
                "name": "flame-charge",
                "power": 50,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "Cloaking itself in flame, the user attacks the target.\nThen, building up more power, the user raises its\nSpeed stat.",
                "effect": "Inflicts regular damage.  Raises the user's Speed by one stage.",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 490,
                "name": "low-sweep",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user makes a swift attack on the target’s legs,\nwhich lowers the target’s Speed stat.",
                "effect": "Lowers the target's Speed by one stage.",
                "machine": "tm47"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 497,
                "name": "echoed-voice",
                "power": 40,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with an echoing voice.\nIf this move is used every turn, its power\nis increased.",
                "effect": "Inflicts regular damage.  If any friendly Pokémon used this move earlier this turn or on the previous turn, that use's power is added to this move's power, to a maximum of 200.",
                "machine": "tm49"
            },
            {
                "id": 315,
                "name": "overheat",
                "power": 130,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks the target at full power. The attack’s\nrecoil harshly lowers the user’s Sp. Atk stat.",
                "effect": "Inflicts regular damage, then lowers the user's Special Attack by two stages.",
                "machine": "tm50"
            },
            {
                "id": 411,
                "name": "focus-blast",
                "power": 120,
                "accuracy": 70,
                "pp": 5,
                "priority": 0,
                "type": "fighting",
                "damage_class": "special",
                "description": "The user heightens its mental focus and unleashes\nits power. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm52"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 261,
                "name": "will-o-wisp",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user shoots a sinister flame at the target to inflict\na burn.",
                "effect": "Burns the target.",
                "machine": "tm61"
            },
            {
                "id": 421,
                "name": "shadow-claw",
                "power": 70,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "physical",
                "description": "The user slashes with a sharp claw made from\nshadows. Critical hits land more easily.",
                "effect": "Inflicts regular damage.  User's critical hit rate is one level higher when using this move.",
                "machine": "tm65"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 398,
                "name": "poison-jab",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "poison",
                "damage_class": "physical",
                "description": "The target is stabbed with a tentacle, arm, or the like\nsteeped in poison. This may also poison the target.",
                "effect": "Inflicts regular damage.  Has a 30% chance to poison the target.",
                "machine": "tm84"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            }
        ]
    },
    "sword-shield": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    }
}