{
    "iii": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 273,
                "name": "wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "One turn after this move is used, the user’s or its\nreplacement’s HP is restored by half the user’s\nmax HP.",
                "effect": "At the end of the next turn, user will be healed for half its max HP.  If the user is switched out, its replacement will be healed instead for half of the user's max HP.  If the user faints or is forcefully switched by roar or whirlwind, this effect will not activate.",
                "level": 1
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 5
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 10
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome.",
                "level": 15
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 20
            },
            {
                "id": 287,
                "name": "refresh",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Removes a burn, paralysis, or poison from the user.",
                "level": 25
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 30
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.",
                "level": 35
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 40
            },
            {
                "id": 322,
                "name": "cosmic-power",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user absorbs a mystical power from space to\nraise its Defense and Sp. Def stats.",
                "effect": "Raises the user's Defense and Special Defense by one stage.",
                "level": 45
            },
            {
                "id": 353,
                "name": "doom-desire",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "Two turns after this move is used, a concentrated\nbundle of light blasts the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 50
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 7,
                "name": "fire-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The target is punched with a fiery fist. This may also\nleave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 8,
                "name": "ice-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "physical",
                "description": "The target is punched with an icy fist. This may also\nleave the target frozen.",
                "effect": "Inflicts regular damage.  Has a 10% chance to freeze the target."
            },
            {
                "id": 9,
                "name": "thunder-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "physical",
                "description": "The target is punched with an electrified fist.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target."
            },
            {
                "id": 34,
                "name": "body-slam",
                "power": 85,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user drops onto the target with its full body\nweight. This may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target."
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil."
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target."
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore."
            },
            {
                "id": 111,
                "name": "defense-curl",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user curls up to conceal weak spots and raise\nits Defense stat.",
                "effect": "Raises user's Defense by one stage.\n\nAfter this move is used, the power of ice ball and rollout are doubled until the user leaves the field."
            },
            {
                "id": 118,
                "name": "metronome",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user waggles a finger and stimulates its brain\ninto randomly using nearly any move.",
                "effect": "Selects any move at random and uses it.  Moves the user already knows are not eligible.  Assist, meta, protection, and reflection moves are also not eligible; specifically, assist, chatter, copycat, counter, covet, destiny bond, detect, endure, feint, focus punch, follow me, helping hand, me first, metronome, mimic, mirror coat, mirror move, protect, quick guard, sketch, sleep talk, snatch, struggle, switcheroo, thief, trick, and wide guard will not be selected by this move.\n\nThis move cannot be copied by mimic or mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers."
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user."
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal."
            },
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 189,
                "name": "mud-slap",
                "power": 20,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "special",
                "description": "The user hurls mud in the target’s face to inflict\ndamage and lower its accuracy.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's accuracy by one stage."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 203,
                "name": "endure",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "The user endures any attack with at least 1 HP.\nIts chance of failing rises if it is used in succession.",
                "effect": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 223,
                "name": "dynamic-punch",
                "power": 100,
                "accuracy": 50,
                "pp": 5,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user punches the target with full, concentrated\npower. This confuses the target if it hits.",
                "effect": "Inflicts regular damage.  Has a 100% chance to confuse the target."
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move."
            }
        ],
        "machine": [
            {
                "id": 352,
                "name": "water-pulse",
                "power": 60,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "water",
                "damage_class": "special",
                "description": "The user attacks the target with a pulsing blast of\nwater. This may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 20% chance to confuse the target.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "hm05"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 63,
                "name": "hyper-beam",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The target is attacked with a powerful beam.\nThe user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm15"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 351,
                "name": "shock-wave",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user strikes the target with a quick jolt of\nelectricity. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm34"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 290,
                "name": "secret-power",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyzes target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyzes target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyzes target\nNeon           | Paralyzes target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail.",
                "machine": "tm48"
            }
        ]
    },
    "iv": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 273,
                "name": "wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "One turn after this move is used, the user’s or its\nreplacement’s HP is restored by half the user’s\nmax HP.",
                "effect": "At the end of the next turn, user will be healed for half its max HP.  If the user is switched out, its replacement will be healed instead for half of the user's max HP.  If the user faints or is forcefully switched by roar or whirlwind, this effect will not activate.",
                "level": 1
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 5
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 10
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome.",
                "level": 15
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 20
            },
            {
                "id": 287,
                "name": "refresh",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Removes a burn, paralysis, or poison from the user.",
                "level": 25
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 30
            },
            {
                "id": 428,
                "name": "zen-headbutt",
                "power": 80,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "physical",
                "description": "The user focuses its willpower to its head and\nattacks the target. This may also make the\ntarget flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
                "level": 35
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.",
                "level": 40
            },
            {
                "id": 356,
                "name": "gravity",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move enables Flying-type Pokémon or Pokémon\nwith the Levitate Ability to be hit by Ground-type\nmoves. Moves that involve flying can’t be used.",
                "effect": "For five turns (including this one), all immunities to ground moves are disabled.  For the duration of this effect, the evasion of every Pokémon on the field is lowered by two stages.  Cancels the effects of bounce, fly, and sky drop.\n\nSpecifically, flying Pokémon and those with levitate or that have used magnet rise are no longer immune to ground attacks, arena trap, spikes, or toxic spikes.\n\nbounce, fly, sky drop, high jump kick, jump kick, and splash cannot be used while this move is in effect.\n\n*Bug*: If this move is used during a double or triple battle while Pokémon are under the effect of sky drop, Sky Drop's effect is not correctly canceled on its target, and it remains high in the air indefinitely.  As Sky Drop prevents the target from acting, the only way to subsequently remove it from the field is to faint it.",
                "level": 45
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead.",
                "level": 50
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 55
            },
            {
                "id": 322,
                "name": "cosmic-power",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user absorbs a mystical power from space to\nraise its Defense and Sp. Def stats.",
                "effect": "Raises the user's Defense and Special Defense by one stage.",
                "level": 60
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail.",
                "level": 65
            },
            {
                "id": 353,
                "name": "doom-desire",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "Two turns after this move is used, a concentrated\nbundle of light blasts the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 70
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 7,
                "name": "fire-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The target is punched with a fiery fist. This may also\nleave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 8,
                "name": "ice-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "physical",
                "description": "The target is punched with an icy fist. This may also\nleave the target frozen.",
                "effect": "Inflicts regular damage.  Has a 10% chance to freeze the target."
            },
            {
                "id": 9,
                "name": "thunder-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "physical",
                "description": "The target is punched with an electrified fist.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target."
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers."
            },
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 189,
                "name": "mud-slap",
                "power": 20,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "special",
                "description": "The user hurls mud in the target’s face to inflict\ndamage and lower its accuracy.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's accuracy by one stage."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 246,
                "name": "ancient-power",
                "power": 60,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "rock",
                "damage_class": "special",
                "description": "The user attacks with a prehistoric power.\nThis may also raise all the user’s stats at once.",
                "effect": "Inflicts regular damage. Has a 10% chance to raise all of the user's stats one stage."
            },
            {
                "id": 253,
                "name": "uproar",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks in an uproar for three turns.\nDuring that time, no Pokémon can fall asleep.",
                "effect": "Inflicts regular damage.  User is forced to use this move for 2–5 turns, selected at random.  All Pokémon on the field wake up, and none can fall to sleep until the lock-in ends.\n\nPokémon cannot use rest during this effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 324,
                "name": "signal-beam",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target."
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages."
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail."
            },
            {
                "id": 428,
                "name": "zen-headbutt",
                "power": 80,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "physical",
                "description": "The user focuses its willpower to its head and\nattacks the target. This may also make the\ntarget flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch."
            },
            {
                "id": 442,
                "name": "iron-head",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user slams the target with its steel-hard head.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch."
            }
        ],
        "machine": [
            {
                "id": 352,
                "name": "water-pulse",
                "power": 60,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "water",
                "damage_class": "special",
                "description": "The user attacks the target with a pulsing blast of\nwater. This may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 20% chance to confuse the target.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 63,
                "name": "hyper-beam",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The target is attacked with a powerful beam.\nThe user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm15"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 351,
                "name": "shock-wave",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user strikes the target with a quick jolt of\nelectricity. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm34"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 290,
                "name": "secret-power",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyzes target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyzes target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyzes target\nNeon           | Paralyzes target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail.",
                "machine": "tm48"
            },
            {
                "id": 412,
                "name": "energy-ball",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user draws power from nature and fires it at the\ntarget. This may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm53"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 203,
                "name": "endure",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "The user endures any attack with at least 1 HP.\nIts chance of failing rises if it is used in succession.",
                "effect": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm58"
            },
            {
                "id": 409,
                "name": "drain-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "An energy-draining punch. The user’s HP is restored\nby half the damage taken by the target.",
                "effect": "Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm60"
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "machine": "tm67"
            },
            {
                "id": 416,
                "name": "giga-impact",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user charges at the target using every bit of its\npower. The user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm68"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 446,
                "name": "stealth-rock",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user lays a trap of levitating stones around the\nopposing team. The trap hurts opposing Pokémon\nthat switch into battle.",
                "effect": "Spreads sharp rocks around the opposing field, damaging any Pokémon that enters the field for 1/8 its max HP.  This damage is affected by the entering Pokémon's susceptibility to rock moves.\n\nrapid spin removes this effect from its user's side of the field.",
                "machine": "tm76"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm82"
            },
            {
                "id": 363,
                "name": "natural-gift",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held berry.  The berry is consumed.  If the user is not holding a berry, this move will fail.",
                "machine": "tm83"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "v": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 273,
                "name": "wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "One turn after this move is used, the user’s or its\nreplacement’s HP is restored by half the user’s\nmax HP.",
                "effect": "At the end of the next turn, user will be healed for half its max HP.  If the user is switched out, its replacement will be healed instead for half of the user's max HP.  If the user faints or is forcefully switched by roar or whirlwind, this effect will not activate.",
                "level": 1
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 5
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 10
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome.",
                "level": 15
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 20
            },
            {
                "id": 287,
                "name": "refresh",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Removes a burn, paralysis, or poison from the user.",
                "level": 25
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 30
            },
            {
                "id": 428,
                "name": "zen-headbutt",
                "power": 80,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "physical",
                "description": "The user focuses its willpower to its head and\nattacks the target. This may also make the\ntarget flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
                "level": 35
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.",
                "level": 40
            },
            {
                "id": 356,
                "name": "gravity",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move enables Flying-type Pokémon or Pokémon\nwith the Levitate Ability to be hit by Ground-type\nmoves. Moves that involve flying can’t be used.",
                "effect": "For five turns (including this one), all immunities to ground moves are disabled.  For the duration of this effect, the evasion of every Pokémon on the field is lowered by two stages.  Cancels the effects of bounce, fly, and sky drop.\n\nSpecifically, flying Pokémon and those with levitate or that have used magnet rise are no longer immune to ground attacks, arena trap, spikes, or toxic spikes.\n\nbounce, fly, sky drop, high jump kick, jump kick, and splash cannot be used while this move is in effect.\n\n*Bug*: If this move is used during a double or triple battle while Pokémon are under the effect of sky drop, Sky Drop's effect is not correctly canceled on its target, and it remains high in the air indefinitely.  As Sky Drop prevents the target from acting, the only way to subsequently remove it from the field is to faint it.",
                "level": 45
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead.",
                "level": 50
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 55
            },
            {
                "id": 322,
                "name": "cosmic-power",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user absorbs a mystical power from space to\nraise its Defense and Sp. Def stats.",
                "effect": "Raises the user's Defense and Special Defense by one stage.",
                "level": 60
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail.",
                "level": 65
            },
            {
                "id": 353,
                "name": "doom-desire",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "Two turns after this move is used, a concentrated\nbundle of light blasts the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 70
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 7,
                "name": "fire-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "physical",
                "description": "The target is punched with a fiery fist. This may also\nleave the target with a burn.",
                "effect": "Inflicts regular damage.  Has a 10% chance to burn the target."
            },
            {
                "id": 8,
                "name": "ice-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "physical",
                "description": "The target is punched with an icy fist. This may also\nleave the target frozen.",
                "effect": "Inflicts regular damage.  Has a 10% chance to freeze the target."
            },
            {
                "id": 9,
                "name": "thunder-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "physical",
                "description": "The target is punched with an electrified fist.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target."
            },
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 253,
                "name": "uproar",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks in an uproar for three turns.\nDuring that time, no Pokémon can fall asleep.",
                "effect": "Inflicts regular damage.  User is forced to use this move for 2–5 turns, selected at random.  All Pokémon on the field wake up, and none can fall to sleep until the lock-in ends.\n\nPokémon cannot use rest during this effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 277,
                "name": "magic-coat",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 4,
                "type": "psychic",
                "damage_class": "status",
                "description": "Moves like Leech Seed and moves that inflict status\nconditions are blocked by a barrier and reflected back\nto the user of those moves.",
                "effect": "The first non-damaging move targeting the user this turn that inflicts major status effects, stat changes, or trapping effects will be reflected at its user.\n\ndefog, memento, and teeter dance are not reflected.\n\nattract, flatter, gastro acid, leech seed, swagger, worry seed, and yawn are reflected.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered."
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail."
            },
            {
                "id": 324,
                "name": "signal-beam",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target."
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages."
            },
            {
                "id": 356,
                "name": "gravity",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move enables Flying-type Pokémon or Pokémon\nwith the Levitate Ability to be hit by Ground-type\nmoves. Moves that involve flying can’t be used.",
                "effect": "For five turns (including this one), all immunities to ground moves are disabled.  For the duration of this effect, the evasion of every Pokémon on the field is lowered by two stages.  Cancels the effects of bounce, fly, and sky drop.\n\nSpecifically, flying Pokémon and those with levitate or that have used magnet rise are no longer immune to ground attacks, arena trap, spikes, or toxic spikes.\n\nbounce, fly, sky drop, high jump kick, jump kick, and splash cannot be used while this move is in effect.\n\n*Bug*: If this move is used during a double or triple battle while Pokémon are under the effect of sky drop, Sky Drop's effect is not correctly canceled on its target, and it remains high in the air indefinitely.  As Sky Drop prevents the target from acting, the only way to subsequently remove it from the field is to faint it."
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail."
            },
            {
                "id": 409,
                "name": "drain-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "An energy-draining punch. The user’s HP is restored\nby half the damage taken by the target.",
                "effect": "Inflicts regular damage.  Drains half the damage inflicted to heal the user."
            },
            {
                "id": 428,
                "name": "zen-headbutt",
                "power": 80,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "physical",
                "description": "The user focuses its willpower to its head and\nattacks the target. This may also make the\ntarget flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch."
            },
            {
                "id": 442,
                "name": "iron-head",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user slams the target with its steel-hard head.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 446,
                "name": "stealth-rock",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user lays a trap of levitating stones around the\nopposing team. The trap hurts opposing Pokémon\nthat switch into battle.",
                "effect": "Spreads sharp rocks around the opposing field, damaging any Pokémon that enters the field for 1/8 its max HP.  This damage is affected by the entering Pokémon's susceptibility to rock moves.\n\nrapid spin removes this effect from its user's side of the field."
            },
            {
                "id": 478,
                "name": "magic-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nheld items lose their effects for five turns.",
                "effect": "For five turns (including this one), passive effects of held items are ignored, and Pokémon will not use their held items."
            }
        ],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 63,
                "name": "hyper-beam",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The target is attacked with a powerful beam.\nThe user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm15"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 477,
                "name": "telekinesis",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For three turns (including this one), moves used against the target have 100% accuracy, but the target is immune to ground damage.  Accuracy of one-hit KO moves is exempt from this effect.\n\nThis effect is removed by gravity.  If Gravity is already in effect, this move will fail.",
                "machine": "tm19"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 412,
                "name": "energy-ball",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user draws power from nature and fires it at the\ntarget. This may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm53"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 416,
                "name": "giga-impact",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user charges at the target using every bit of its\npower. The user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm68"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "vi": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 273,
                "name": "wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "One turn after this move is used, the user’s or its\nreplacement’s HP is restored by half the user’s\nmax HP.",
                "effect": "At the end of the next turn, user will be healed for half its max HP.  If the user is switched out, its replacement will be healed instead for half of the user's max HP.  If the user faints or is forcefully switched by roar or whirlwind, this effect will not activate.",
                "level": 1
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 5
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 10
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome.",
                "level": 15
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 20
            },
            {
                "id": 287,
                "name": "refresh",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Removes a burn, paralysis, or poison from the user.",
                "level": 25
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 30
            },
            {
                "id": 428,
                "name": "zen-headbutt",
                "power": 80,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "physical",
                "description": "The user focuses its willpower to its head and\nattacks the target. This may also make the\ntarget flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
                "level": 35
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.",
                "level": 40
            },
            {
                "id": 356,
                "name": "gravity",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move enables Flying-type Pokémon or Pokémon\nwith the Levitate Ability to be hit by Ground-type\nmoves. Moves that involve flying can’t be used.",
                "effect": "For five turns (including this one), all immunities to ground moves are disabled.  For the duration of this effect, the evasion of every Pokémon on the field is lowered by two stages.  Cancels the effects of bounce, fly, and sky drop.\n\nSpecifically, flying Pokémon and those with levitate or that have used magnet rise are no longer immune to ground attacks, arena trap, spikes, or toxic spikes.\n\nbounce, fly, sky drop, high jump kick, jump kick, and splash cannot be used while this move is in effect.\n\n*Bug*: If this move is used during a double or triple battle while Pokémon are under the effect of sky drop, Sky Drop's effect is not correctly canceled on its target, and it remains high in the air indefinitely.  As Sky Drop prevents the target from acting, the only way to subsequently remove it from the field is to faint it.",
                "level": 45
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead.",
                "level": 50
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 55
            },
            {
                "id": 322,
                "name": "cosmic-power",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user absorbs a mystical power from space to\nraise its Defense and Sp. Def stats.",
                "effect": "Raises the user's Defense and Special Defense by one stage.",
                "level": 60
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail.",
                "level": 65
            },
            {
                "id": 353,
                "name": "doom-desire",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "Two turns after this move is used, a concentrated\nbundle of light blasts the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 70
            }
        ],
        "egg": [],
        "tutor": [],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 63,
                "name": "hyper-beam",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The target is attacked with a powerful beam.\nThe user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm15"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 412,
                "name": "energy-ball",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user draws power from nature and fires it at the\ntarget. This may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm53"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 416,
                "name": "giga-impact",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user charges at the target using every bit of its\npower. The user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm68"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            },
            {
                "id": 612,
                "name": "power-up-punch",
                "power": 40,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "Striking opponents over and over makes the user’s\nfists harder. Hitting a target raises the Attack stat.",
                "effect": "Inflicts regular damage.  Raises the user's Attack by one stage.",
                "machine": "tm98"
            },
            {
                "id": 605,
                "name": "dazzling-gleam",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fairy",
                "damage_class": "special",
                "description": "The user damages opposing Pokémon by emitting a\npowerful flash.",
                "effect": "Inflicts regular damage.",
                "machine": "tm99"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            }
        ]
    },
    "vii": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 273,
                "name": "wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "One turn after this move is used, the user’s or its\nreplacement’s HP is restored by half the user’s\nmax HP.",
                "effect": "At the end of the next turn, user will be healed for half its max HP.  If the user is switched out, its replacement will be healed instead for half of the user's max HP.  If the user faints or is forcefully switched by roar or whirlwind, this effect will not activate.",
                "level": 1
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "level": 5
            },
            {
                "id": 129,
                "name": "swift",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "Star-shaped rays are shot at opposing Pokémon.\nThis attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 10
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome.",
                "level": 15
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 20
            },
            {
                "id": 287,
                "name": "refresh",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Removes a burn, paralysis, or poison from the user.",
                "level": 25
            },
            {
                "id": 381,
                "name": "lucky-chant",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For five turns, opposing Pokémon cannot score critical hits.",
                "level": 30
            },
            {
                "id": 428,
                "name": "zen-headbutt",
                "power": 80,
                "accuracy": 90,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "physical",
                "description": "The user focuses its willpower to its head and\nattacks the target. This may also make the\ntarget flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
                "level": 35
            },
            {
                "id": 38,
                "name": "double-edge",
                "power": 120,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A reckless, life-risking tackle in which the user rushes\nthe target. This also damages the user quite a lot.",
                "effect": "Inflicts regular damage.  User takes 1/3 the damage it inflicts in recoil.",
                "level": 40
            },
            {
                "id": 356,
                "name": "gravity",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move enables Flying-type Pokémon or Pokémon\nwith the Levitate Ability to be hit by Ground-type\nmoves. Moves that involve flying can’t be used.",
                "effect": "For five turns (including this one), all immunities to ground moves are disabled.  For the duration of this effect, the evasion of every Pokémon on the field is lowered by two stages.  Cancels the effects of bounce, fly, and sky drop.\n\nSpecifically, flying Pokémon and those with levitate or that have used magnet rise are no longer immune to ground attacks, arena trap, spikes, or toxic spikes.\n\nbounce, fly, sky drop, high jump kick, jump kick, and splash cannot be used while this move is in effect.\n\n*Bug*: If this move is used during a double or triple battle while Pokémon are under the effect of sky drop, Sky Drop's effect is not correctly canceled on its target, and it remains high in the air indefinitely.  As Sky Drop prevents the target from acting, the only way to subsequently remove it from the field is to faint it.",
                "level": 45
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead.",
                "level": 50
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 55
            },
            {
                "id": 322,
                "name": "cosmic-power",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user absorbs a mystical power from space to\nraise its Defense and Sp. Def stats.",
                "effect": "Raises the user's Defense and Special Defense by one stage.",
                "level": 60
            },
            {
                "id": 387,
                "name": "last-resort",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can be used only after the user has used\nall the other moves it knows in the battle.",
                "effect": "Inflicts regular damage.  This move can only be used if each of the user's other moves has been used at least once since the user entered the field.  If this is the user's only move, this move will fail.",
                "level": 65
            },
            {
                "id": 353,
                "name": "doom-desire",
                "power": 140,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "Two turns after this move is used, a concentrated\nbundle of light blasts the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 70
            }
        ],
        "egg": [],
        "tutor": [],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 63,
                "name": "hyper-beam",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The target is attacked with a powerful beam.\nThe user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm15"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 412,
                "name": "energy-ball",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user draws power from nature and fires it at the\ntarget. This may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm53"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 416,
                "name": "giga-impact",
                "power": 150,
                "accuracy": 90,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user charges at the target using every bit of its\npower. The user can’t move on the next turn.",
                "effect": "Inflicts regular damage.  User loses its next turn to \"recharge\", and cannot attack or switch out during that turn.",
                "machine": "tm68"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            },
            {
                "id": 605,
                "name": "dazzling-gleam",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fairy",
                "damage_class": "special",
                "description": "The user damages opposing Pokémon by emitting a\npowerful flash.",
                "effect": "Inflicts regular damage.",
                "machine": "tm99"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            }
        ]
    }
}