{
    "iv": {
        "level-up": [
            {
                "id": 33,
                "name": "tackle",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A physical attack in which the user charges and\nslams into the target with its whole body.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep.",
                "level": 7
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 12
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target.",
                "level": 14
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch.",
                "level": 19
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 26
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 30
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "level": 35
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 37
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 41
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "level": 49
            },
            {
                "id": 377,
                "name": "heal-block",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For the next five turns, the target may not use any moves that only restore HP, and move effects that heal the target are disabled.  Moves that steal HP may still be used, but will only inflict damage and not heal the target.",
                "level": 52
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 205,
                "name": "rollout",
                "power": 30,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "The user continually rolls into the target over five\nturns. It becomes more powerful each time it hits.",
                "effect": "Inflicts regular damage.  User is forced to use this move for five turns.  Power doubles every time this move is used in succession to a maximum of 16x, and resets to normal after the lock-in ends.  If this move misses or becomes unusable, the lock-in ends.\n\nIf the user has used defense curl since entering the field, this move has double power."
            },
            {
                "id": 246,
                "name": "ancient-power",
                "power": 60,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "rock",
                "damage_class": "special",
                "description": "The user attacks with a prehistoric power.\nThis may also raise all the user’s stats at once.",
                "effect": "Inflicts regular damage. Has a 10% chance to raise all of the user's stats one stage."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 324,
                "name": "signal-beam",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target."
            }
        ],
        "machine": [
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 89,
                "name": "earthquake",
                "power": 100,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user sets off an earthquake that strikes every\nPokémon around it.",
                "effect": "Inflicts regular damage.\n\nIf the target is in the first turn of dig, this move will hit with double power.",
                "machine": "tm26"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 290,
                "name": "secret-power",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyzes target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyzes target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyzes target\nNeon           | Paralyzes target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail.",
                "machine": "tm48"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 203,
                "name": "endure",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "The user endures any attack with at least 1 HP.\nIts chance of failing rises if it is used in succession.",
                "effect": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm58"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "machine": "tm67"
            },
            {
                "id": 397,
                "name": "rock-polish",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user polishes its body to reduce drag.\nThis sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "machine": "tm69"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "machine": "tm74"
            },
            {
                "id": 446,
                "name": "stealth-rock",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user lays a trap of levitating stones around the\nopposing team. The trap hurts opposing Pokémon\nthat switch into battle.",
                "effect": "Spreads sharp rocks around the opposing field, damaging any Pokémon that enters the field for 1/8 its max HP.  This damage is affected by the entering Pokémon's susceptibility to rock moves.\n\nrapid spin removes this effect from its user's side of the field.",
                "machine": "tm76"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm82"
            },
            {
                "id": 363,
                "name": "natural-gift",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held berry.  The berry is consumed.  If the user is not holding a berry, this move will fail.",
                "machine": "tm83"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "v": {
        "level-up": [
            {
                "id": 33,
                "name": "tackle",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A physical attack in which the user charges and\nslams into the target with its whole body.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep.",
                "level": 5
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 9
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target.",
                "level": 11
            },
            {
                "id": 149,
                "name": "psywave",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts typeless damage between 50% and 150% of the user's level, selected at random in increments of 10%.",
                "level": 15
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 19
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 21
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 25
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 29
            },
            {
                "id": 319,
                "name": "metal-sound",
                "power": null,
                "accuracy": 85,
                "pp": 40,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "A horrible sound like scraping metal harshly lowers\nthe target’s Sp. Def stat.",
                "effect": "Lowers the target's Special Defense by two stages.",
                "level": 31
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "level": 35
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch.",
                "level": 39
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "level": 41
            },
            {
                "id": 377,
                "name": "heal-block",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For the next five turns, the target may not use any moves that only restore HP, and move effects that heal the target are disabled.  Moves that steal HP may still be used, but will only inflict damage and not heal the target.",
                "level": 45
            },
            {
                "id": 484,
                "name": "heavy-slam",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user slams into the target with its heavy body.\nThe more the user outweighs the target, the greater\nthe move’s power.",
                "effect": "Inflicts regular damage.  The greater the user's weight compared to the target's, the higher power this move has, to a maximum of 120.\n\nUser's weight                    | Power\n-------------------------------- | ----:\nUp to 2× the target's weight     |    40\nUp to 3× the target's weight     |    60\nUp to 4× the target's weight     |    80\nUp to 5× the target's weight     |   100\nMore than 5× the target's weight |   120\n",
                "level": 49
            }
        ],
        "egg": [],
        "tutor": [
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered."
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail."
            },
            {
                "id": 324,
                "name": "signal-beam",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target."
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages."
            },
            {
                "id": 356,
                "name": "gravity",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move enables Flying-type Pokémon or Pokémon\nwith the Levitate Ability to be hit by Ground-type\nmoves. Moves that involve flying can’t be used.",
                "effect": "For five turns (including this one), all immunities to ground moves are disabled.  For the duration of this effect, the evasion of every Pokémon on the field is lowered by two stages.  Cancels the effects of bounce, fly, and sky drop.\n\nSpecifically, flying Pokémon and those with levitate or that have used magnet rise are no longer immune to ground attacks, arena trap, spikes, or toxic spikes.\n\nbounce, fly, sky drop, high jump kick, jump kick, and splash cannot be used while this move is in effect.\n\n*Bug*: If this move is used during a double or triple battle while Pokémon are under the effect of sky drop, Sky Drop's effect is not correctly canceled on its target, and it remains high in the air indefinitely.  As Sky Drop prevents the target from acting, the only way to subsequently remove it from the field is to faint it."
            },
            {
                "id": 446,
                "name": "stealth-rock",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user lays a trap of levitating stones around the\nopposing team. The trap hurts opposing Pokémon\nthat switch into battle.",
                "effect": "Spreads sharp rocks around the opposing field, damaging any Pokémon that enters the field for 1/8 its max HP.  This damage is affected by the entering Pokémon's susceptibility to rock moves.\n\nrapid spin removes this effect from its user's side of the field."
            },
            {
                "id": 472,
                "name": "wonder-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nDefense and Sp. Def stats are swapped for\nfive turns.",
                "effect": "For five turns (including this one), every Pokémon's Defense and Special Defense are swapped."
            }
        ],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 477,
                "name": "telekinesis",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For three turns (including this one), moves used against the target have 100% accuracy, but the target is immune to ground damage.  Accuracy of one-hit KO moves is exempt from this effect.\n\nThis effect is removed by gravity.  If Gravity is already in effect, this move will fail.",
                "machine": "tm19"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 89,
                "name": "earthquake",
                "power": 100,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user sets off an earthquake that strikes every\nPokémon around it.",
                "effect": "Inflicts regular damage.\n\nIf the target is in the first turn of dig, this move will hit with double power.",
                "machine": "tm26"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 397,
                "name": "rock-polish",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user polishes its body to reduce drag.\nThis sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "machine": "tm69"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "machine": "tm74"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 523,
                "name": "bulldoze",
                "power": 60,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user strikes everything around it by stomping\ndown on the ground. This lowers the Speed stats of\nthose hit.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm78"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "vi": {
        "level-up": [
            {
                "id": 33,
                "name": "tackle",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A physical attack in which the user charges and\nslams into the target with its whole body.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep.",
                "level": 5
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 9
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target.",
                "level": 11
            },
            {
                "id": 149,
                "name": "psywave",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts typeless damage between 50% and 150% of the user's level, selected at random in increments of 10%.",
                "level": 15
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 19
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 21
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 25
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 29
            },
            {
                "id": 319,
                "name": "metal-sound",
                "power": null,
                "accuracy": 85,
                "pp": 40,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "A horrible sound like scraping metal harshly lowers\nthe target’s Sp. Def stat.",
                "effect": "Lowers the target's Special Defense by two stages.",
                "level": 31
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "level": 35
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch.",
                "level": 39
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "level": 41
            },
            {
                "id": 377,
                "name": "heal-block",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For the next five turns, the target may not use any moves that only restore HP, and move effects that heal the target are disabled.  Moves that steal HP may still be used, but will only inflict damage and not heal the target.",
                "level": 45
            },
            {
                "id": 484,
                "name": "heavy-slam",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user slams into the target with its heavy body.\nThe more the user outweighs the target, the greater\nthe move’s power.",
                "effect": "Inflicts regular damage.  The greater the user's weight compared to the target's, the higher power this move has, to a maximum of 120.\n\nUser's weight                    | Power\n-------------------------------- | ----:\nUp to 2× the target's weight     |    40\nUp to 3× the target's weight     |    60\nUp to 4× the target's weight     |    80\nUp to 5× the target's weight     |   100\nMore than 5× the target's weight |   120\n",
                "level": 49
            }
        ],
        "egg": [],
        "tutor": [],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 89,
                "name": "earthquake",
                "power": 100,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user sets off an earthquake that strikes every\nPokémon around it.",
                "effect": "Inflicts regular damage.\n\nIf the target is in the first turn of dig, this move will hit with double power.",
                "machine": "tm26"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 397,
                "name": "rock-polish",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user polishes its body to reduce drag.\nThis sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "machine": "tm69"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "machine": "tm74"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 523,
                "name": "bulldoze",
                "power": 60,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user strikes everything around it by stomping\ndown on the ground. This lowers the Speed stats of\nthose hit.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm78"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "vii": {
        "level-up": [
            {
                "id": 33,
                "name": "tackle",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "A physical attack in which the user charges and\nslams into the target with its whole body.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep.",
                "level": 5
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 9
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target.",
                "level": 11
            },
            {
                "id": 149,
                "name": "psywave",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts typeless damage between 50% and 150% of the user's level, selected at random in increments of 10%.",
                "level": 15
            },
            {
                "id": 334,
                "name": "iron-defense",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "The user hardens its body’s surface like iron,\nsharply raising its Defense stat.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 19
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 21
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 25
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move.",
                "level": 29
            },
            {
                "id": 319,
                "name": "metal-sound",
                "power": null,
                "accuracy": 85,
                "pp": 40,
                "priority": 0,
                "type": "steel",
                "damage_class": "status",
                "description": "A horrible sound like scraping metal harshly lowers\nthe target’s Sp. Def stat.",
                "effect": "Lowers the target's Special Defense by two stages.",
                "level": 31
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "level": 35
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch.",
                "level": 39
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "level": 41
            },
            {
                "id": 377,
                "name": "heal-block",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For the next five turns, the target may not use any moves that only restore HP, and move effects that heal the target are disabled.  Moves that steal HP may still be used, but will only inflict damage and not heal the target.",
                "level": 45
            },
            {
                "id": 484,
                "name": "heavy-slam",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user slams into the target with its heavy body.\nThe more the user outweighs the target, the greater\nthe move’s power.",
                "effect": "Inflicts regular damage.  The greater the user's weight compared to the target's, the higher power this move has, to a maximum of 120.\n\nUser's weight                    | Power\n-------------------------------- | ----:\nUp to 2× the target's weight     |    40\nUp to 3× the target's weight     |    60\nUp to 4× the target's weight     |    80\nUp to 5× the target's weight     |   100\nMore than 5× the target's weight |   120\n",
                "level": 49
            }
        ],
        "egg": [],
        "tutor": [],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 89,
                "name": "earthquake",
                "power": 100,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user sets off an earthquake that strikes every\nPokémon around it.",
                "effect": "Inflicts regular damage.\n\nIf the target is in the first turn of dig, this move will hit with double power.",
                "machine": "tm26"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 201,
                "name": "sandstorm",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "A five-turn sandstorm is summoned to hurt all\ncombatants except Rock, Ground, and Steel types.\nIt raises the Sp. Def stat of Rock types.",
                "effect": "Changes the weather to a sandstorm for five turns.  Pokémon that are not ground, rock, or steel take 1/16 their max HP at the end of every turn.  Every rock Pokémon's original Special Defense is raised by 50% for the duration of this effect.\n\nsolar beam's power is halved.\n\nmoonlight, morning sun, and synthesis only heal 1/4 the user's max HP.",
                "machine": "tm37"
            },
            {
                "id": 317,
                "name": "rock-tomb",
                "power": 60,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Boulders are hurled at the target. This also lowers\nthe target’s Speed stat by preventing its movement.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm39"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 397,
                "name": "rock-polish",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "rock",
                "damage_class": "status",
                "description": "The user polishes its body to reduce drag.\nThis sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "machine": "tm69"
            },
            {
                "id": 360,
                "name": "gyro-ball",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "steel",
                "damage_class": "physical",
                "description": "The user tackles the target with a high-speed spin.\nThe slower the user compared to the target, the\ngreater the move’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's current Speed compared to the user, given by `1 + 25 * target Speed / user Speed`, capped at 150.",
                "machine": "tm74"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 523,
                "name": "bulldoze",
                "power": 60,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user strikes everything around it by stomping\ndown on the ground. This lowers the Speed stats of\nthose hit.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage.",
                "machine": "tm78"
            },
            {
                "id": 157,
                "name": "rock-slide",
                "power": 75,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "rock",
                "damage_class": "physical",
                "description": "Large boulders are hurled at opposing Pokémon to\ninflict damage. This may also make the opposing\nPokémon flinch.",
                "effect": "Inflicts regular damage.  Has a 30% chance to make the target flinch.",
                "machine": "tm80"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 430,
                "name": "flash-cannon",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "steel",
                "damage_class": "special",
                "description": "The user gathers all its light energy and releases it\nall at once. This may also lower the target’s\nSp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm91"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    }
}