{
    "yellow": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "crystal": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "emerald": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "platinum": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 112,
                "name": "barrier",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 1
            },
            {
                "id": 321,
                "name": "tickle",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tickles the target into laughing, reducing its\nAttack and Defense stats.",
                "effect": "Lowers the target's Attack and Defense by one stage.",
                "level": 1
            },
            {
                "id": 383,
                "name": "copycat",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user mimics the move used immediately before\nit. The move fails if no other move has been\nused yet.",
                "effect": "Uses the last move that was used successfully by any Pokémon, including the user.\n\nThis move cannot copy itself, nor roar nor whirlwind.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "level": 4
            },
            {
                "id": 96,
                "name": "meditate",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Attack by one stage.",
                "level": 8
            },
            {
                "id": 227,
                "name": "encore",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user compels the target to keep using the move\nit encored for three turns.",
                "effect": "The next 4–8 times (selected at random) the target attempts to move, it is forced to repeat its last used move.  If the selected move allows the trainer to select a target, an opponent will be selected at random each turn.  If the target is prevented from using the selected move by some other effect, struggle will be used instead.  This effect ends if the selected move runs out of PP.\n\nIf the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, if it does not know the selected move, or if the selected move has 0 PP remaining, this move will fail.  If the target's last used move was encore, mimic, mirror move, sketch, struggle, or transform, this move will fail.",
                "level": 11
            },
            {
                "id": 3,
                "name": "double-slap",
                "power": 15,
                "accuracy": 85,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 15
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore.",
                "level": 18
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 60,
                "name": "psybeam",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is attacked with a peculiar ray. This may\nalso leave the target confused.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 25
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "level": 29
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "level": 32
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "level": 36
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 39
            },
            {
                "id": 272,
                "name": "role-play",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user mimics the target completely, copying the\ntarget’s Ability.",
                "effect": "User's ability is replaced with the target's until the user leaves the field.  Ignores accuracy and evasion modifiers.\n\nIf the target has flower gift, forecast, illusion, imposter, multitype, stance change, trace, wonder guard, or zen mode, this move will fail.\n\nThis move cannot be copied by mirror move.",
                "level": 43
            },
            {
                "id": 226,
                "name": "baton-pass",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user switches places with a party Pokémon in\nwaiting and passes along any stat changes.",
                "effect": "User switches out, and the trainer selects a replacement Pokémon from the party.  Stat changes, confusion, and persistent move effects are passed along to the replacement Pokémon.\n\nThe following move effects are passed:\n\n* aqua ring\n* both the user's and target's effect of block, mean look, and spider web\n* the curse effect of curse\n* embargo\n* focus energy or an activated lansat berry\n* gastro acid\n* ingrain\n* being sapped by leech seed\n* being targeted by lock on or mind reader\n* magnet rise\n* perish song's counter\n* power trick\n* substitute; the doll's HP is unchanged\n\nThe replacement Pokémon does not trigger effects that respond to Pokémon switching in.",
                "level": 46
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 50
            }
        ],
        "egg": [
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep."
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore."
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target."
            },
            {
                "id": 204,
                "name": "charm",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fairy",
                "damage_class": "status",
                "description": "The user gazes at the target rather charmingly,\nmaking it less wary. This harshly lowers the target’s\nAttack stat.",
                "effect": "Lowers the target's Attack by two stages."
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 252,
                "name": "fake-out",
                "power": 40,
                "accuracy": 100,
                "pp": 10,
                "priority": 3,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack hits first and makes the target flinch.\nIt only works the first turn each time the user\nenters battle.",
                "effect": "Inflicts regular damage.  Causes the target to flinch.  Can only be used on the user's first turn after entering the field."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 298,
                "name": "teeter-dance",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user performs a wobbly dance that confuses\nthe Pokémon around it.",
                "effect": "Confuses all targets."
            },
            {
                "id": 358,
                "name": "wake-up-slap",
                "power": 70,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target is sleeping, this move has double power, and the target wakes up."
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead."
            }
        ],
        "tutor": [
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 189,
                "name": "mud-slap",
                "power": 20,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "special",
                "description": "The user hurls mud in the target’s face to inflict\ndamage and lower its accuracy.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's accuracy by one stage."
            },
            {
                "id": 253,
                "name": "uproar",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks in an uproar for three turns.\nDuring that time, no Pokémon can fall asleep.",
                "effect": "Inflicts regular damage.  User is forced to use this move for 2–5 turns, selected at random.  All Pokémon on the field wake up, and none can fall to sleep until the lock-in ends.\n\nPokémon cannot use rest during this effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 324,
                "name": "signal-beam",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target."
            }
        ],
        "machine": [
            {
                "id": 264,
                "name": "focus-punch",
                "power": 150,
                "accuracy": 100,
                "pp": 20,
                "priority": -3,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user focuses its mind before launching a punch.\nThis move fails if the user is hit before it is used.",
                "effect": "Inflicts regular damage.  If the user takes damage this turn before hitting, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm01"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 351,
                "name": "shock-wave",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user strikes the target with a quick jolt of\nelectricity. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm34"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 290,
                "name": "secret-power",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 30% chance to inflict an effect chosen according to the terrain.\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nBuilding       | Paralyzes target\nCave           | Makes target flinch\nDeep water     | Lowers target's Attack by one stage\nDesert         | Lowers target's accuracy by one stage\nGrass          | Puts target to sleep\nMountain       | Makes target flinch\nRoad           | Lowers target's accuracy by one stage\nShallow water  | Lowers target's Attack by one stage\nSnow           | Freezes target\nTall grass     | Puts target to sleep\n\nIn Pokémon Battle Revolution:\n\nTerrain        | Effect\n-------------- | -------------------------------------------------------------\nCourtyard      | Paralyzes target\nCrystal        | Makes target flinch\nGateway        | Lowers target's Attack by one stage\nMagma          | Makes target flinch\nMain Street    | Paralyzes target\nNeon           | Paralyzes target\nStargazer      | Makes target flinch\nSunny Park     | Puts target to sleep\nSunset         | Lowers target's accuracy by one stage\nWaterfall      | Puts target to sleep\n",
                "machine": "tm43"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail.",
                "machine": "tm48"
            },
            {
                "id": 289,
                "name": "snatch",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "The next time a Pokémon uses a beneficial move on itself or itself and its ally this turn, the user of this move will steal the move and use it itself.  Moves which may be stolen by this move are identified by the \"snatchable\" flag.\n\nIf two Pokémon use this move on the same turn, the faster Pokémon will steal the first beneficial move, and the slower Pokémon will then steal it again—thus, only the slowest Pokémon using this move ultimately gains a stolen move's effect.\n\nIf the user steals psych up, it will target the Pokémon that used psych up.  If the user was the original target of psych up, and the Pokémon that originally used it's affected by pressure, it will only lose 1 PP.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome.",
                "machine": "tm49"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 203,
                "name": "endure",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "The user endures any attack with at least 1 HP.\nIts chance of failing rises if it is used in succession.",
                "effect": "The user's HP cannot be lowered below 1 by any means for the remainder of this turn.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm58"
            },
            {
                "id": 409,
                "name": "drain-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "An energy-draining punch. The user’s HP is restored\nby half the damage taken by the target.",
                "effect": "Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm60"
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "machine": "tm67"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 445,
                "name": "captivate",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's Special Attack by two stages.  If the user and target are the same gender, or either is genderless, this move will fail.",
                "machine": "tm78"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm82"
            },
            {
                "id": 363,
                "name": "natural-gift",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held berry.  The berry is consumed.  If the user is not holding a berry, this move will fail.",
                "machine": "tm83"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "black-2-white-2": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 112,
                "name": "barrier",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 1
            },
            {
                "id": 321,
                "name": "tickle",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tickles the target into laughing, reducing its\nAttack and Defense stats.",
                "effect": "Lowers the target's Attack and Defense by one stage.",
                "level": 1
            },
            {
                "id": 383,
                "name": "copycat",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user mimics the move used immediately before\nit. The move fails if no other move has been\nused yet.",
                "effect": "Uses the last move that was used successfully by any Pokémon, including the user.\n\nThis move cannot copy itself, nor roar nor whirlwind.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "level": 4
            },
            {
                "id": 96,
                "name": "meditate",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Attack by one stage.",
                "level": 8
            },
            {
                "id": 3,
                "name": "double-slap",
                "power": 15,
                "accuracy": 85,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 11
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore.",
                "level": 15
            },
            {
                "id": 227,
                "name": "encore",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user compels the target to keep using the move\nit encored for three turns.",
                "effect": "The next 4–8 times (selected at random) the target attempts to move, it is forced to repeat its last used move.  If the selected move allows the trainer to select a target, an opponent will be selected at random each turn.  If the target is prevented from using the selected move by some other effect, struggle will be used instead.  This effect ends if the selected move runs out of PP.\n\nIf the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, if it does not know the selected move, or if the selected move has 0 PP remaining, this move will fail.  If the target's last used move was encore, mimic, mirror move, sketch, struggle, or transform, this move will fail.",
                "level": 18
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 60,
                "name": "psybeam",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is attacked with a peculiar ray. This may\nalso leave the target confused.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 25
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "level": 29
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "level": 32
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "level": 36
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 39
            },
            {
                "id": 272,
                "name": "role-play",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user mimics the target completely, copying the\ntarget’s Ability.",
                "effect": "User's ability is replaced with the target's until the user leaves the field.  Ignores accuracy and evasion modifiers.\n\nIf the target has flower gift, forecast, illusion, imposter, multitype, stance change, trace, wonder guard, or zen mode, this move will fail.\n\nThis move cannot be copied by mirror move.",
                "level": 43
            },
            {
                "id": 226,
                "name": "baton-pass",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user switches places with a party Pokémon in\nwaiting and passes along any stat changes.",
                "effect": "User switches out, and the trainer selects a replacement Pokémon from the party.  Stat changes, confusion, and persistent move effects are passed along to the replacement Pokémon.\n\nThe following move effects are passed:\n\n* aqua ring\n* both the user's and target's effect of block, mean look, and spider web\n* the curse effect of curse\n* embargo\n* focus energy or an activated lansat berry\n* gastro acid\n* ingrain\n* being sapped by leech seed\n* being targeted by lock on or mind reader\n* magnet rise\n* perish song's counter\n* power trick\n* substitute; the doll's HP is unchanged\n\nThe replacement Pokémon does not trigger effects that respond to Pokémon switching in.",
                "level": 46
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 50
            }
        ],
        "egg": [
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep."
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore."
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 204,
                "name": "charm",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fairy",
                "damage_class": "status",
                "description": "The user gazes at the target rather charmingly,\nmaking it less wary. This harshly lowers the target’s\nAttack stat.",
                "effect": "Lowers the target's Attack by two stages."
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 252,
                "name": "fake-out",
                "power": 40,
                "accuracy": 100,
                "pp": 10,
                "priority": 3,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack hits first and makes the target flinch.\nIt only works the first turn each time the user\nenters battle.",
                "effect": "Inflicts regular damage.  Causes the target to flinch.  Can only be used on the user's first turn after entering the field."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 298,
                "name": "teeter-dance",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user performs a wobbly dance that confuses\nthe Pokémon around it.",
                "effect": "Confuses all targets."
            },
            {
                "id": 358,
                "name": "wake-up-slap",
                "power": 70,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target is sleeping, this move has double power, and the target wakes up."
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead."
            },
            {
                "id": 417,
                "name": "nasty-plot",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user stimulates its brain by thinking bad\nthoughts. This sharply raises the user’s Sp. Atk stat.",
                "effect": "Raises the user's Special Attack by two stages."
            },
            {
                "id": 471,
                "name": "power-split",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to average its\nAttack and Sp. Atk stats with those of the target.",
                "effect": "Averages the user's unmodified Attack with the target's unmodified Attack; the value becomes the unmodified Attack for both Pokémon. Unmodified Special Attack is averaged the same way.\n\nThis effect applies before any other persistent changes to unmodified Attack or Special Attack, such as flower gift during sunny day."
            },
            {
                "id": 478,
                "name": "magic-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nheld items lose their effects for five turns.",
                "effect": "For five turns (including this one), passive effects of held items are ignored, and Pokémon will not use their held items."
            }
        ],
        "tutor": [
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 253,
                "name": "uproar",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks in an uproar for three turns.\nDuring that time, no Pokémon can fall asleep.",
                "effect": "Inflicts regular damage.  User is forced to use this move for 2–5 turns, selected at random.  All Pokémon on the field wake up, and none can fall to sleep until the lock-in ends.\n\nPokémon cannot use rest during this effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 270,
                "name": "helping-hand",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 5,
                "type": "normal",
                "damage_class": "status",
                "description": "The user assists an ally by boosting the power of\nthat ally’s attack.",
                "effect": "Boosts the power of the target's moves by 50% until the end of this turn.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 272,
                "name": "role-play",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user mimics the target completely, copying the\ntarget’s Ability.",
                "effect": "User's ability is replaced with the target's until the user leaves the field.  Ignores accuracy and evasion modifiers.\n\nIf the target has flower gift, forecast, illusion, imposter, multitype, stance change, trace, wonder guard, or zen mode, this move will fail.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 277,
                "name": "magic-coat",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 4,
                "type": "psychic",
                "damage_class": "status",
                "description": "Moves like Leech Seed and moves that inflict status\nconditions are blocked by a barrier and reflected back\nto the user of those moves.",
                "effect": "The first non-damaging move targeting the user this turn that inflicts major status effects, stat changes, or trapping effects will be reflected at its user.\n\ndefog, memento, and teeter dance are not reflected.\n\nattract, flatter, gastro acid, leech seed, swagger, worry seed, and yawn are reflected.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered."
            },
            {
                "id": 285,
                "name": "skill-swap",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to exchange\nAbilities with the target.",
                "effect": "User and target switch abilities.  Ignores accuracy and evasion modifiers.\n\nIf either Pokémon has multitype or wonder guard, this move will fail."
            },
            {
                "id": 289,
                "name": "snatch",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "The next time a Pokémon uses a beneficial move on itself or itself and its ally this turn, the user of this move will steal the move and use it itself.  Moves which may be stolen by this move are identified by the \"snatchable\" flag.\n\nIf two Pokémon use this move on the same turn, the faster Pokémon will steal the first beneficial move, and the slower Pokémon will then steal it again—thus, only the slowest Pokémon using this move ultimately gains a stolen move's effect.\n\nIf the user steals psych up, it will target the Pokémon that used psych up.  If the user was the original target of psych up, and the Pokémon that originally used it's affected by pressure, it will only lose 1 PP.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 324,
                "name": "signal-beam",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target."
            },
            {
                "id": 343,
                "name": "covet",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user endearingly approaches the target, then\nsteals the target’s held item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 409,
                "name": "drain-punch",
                "power": 75,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "An energy-draining punch. The user’s HP is restored\nby half the damage taken by the target.",
                "effect": "Inflicts regular damage.  Drains half the damage inflicted to heal the user."
            },
            {
                "id": 472,
                "name": "wonder-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nDefense and Sp. Def stats are swapped for\nfive turns.",
                "effect": "For five turns (including this one), every Pokémon's Defense and Special Defense are swapped."
            },
            {
                "id": 478,
                "name": "magic-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nheld items lose their effects for five turns.",
                "effect": "For five turns (including this one), passive effects of held items are ignored, and Pokémon will not use their held items."
            }
        ],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 477,
                "name": "telekinesis",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "For three turns (including this one), moves used against the target have 100% accuracy, but the target is immune to ground damage.  Accuracy of one-hit KO moves is exempt from this effect.\n\nThis effect is removed by gravity.  If Gravity is already in effect, this move will fail.",
                "machine": "tm19"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "x-y": {
        "level-up": [
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 112,
                "name": "barrier",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 1
            },
            {
                "id": 321,
                "name": "tickle",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tickles the target into laughing, reducing its\nAttack and Defense stats.",
                "effect": "Lowers the target's Attack and Defense by one stage.",
                "level": 1
            },
            {
                "id": 383,
                "name": "copycat",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user mimics the move used immediately before\nit. The move fails if no other move has been\nused yet.",
                "effect": "Uses the last move that was used successfully by any Pokémon, including the user.\n\nThis move cannot copy itself, nor roar nor whirlwind.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "level": 4
            },
            {
                "id": 96,
                "name": "meditate",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Attack by one stage.",
                "level": 8
            },
            {
                "id": 3,
                "name": "double-slap",
                "power": 15,
                "accuracy": 85,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 11
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore.",
                "level": 15
            },
            {
                "id": 227,
                "name": "encore",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user compels the target to keep using the move\nit encored for three turns.",
                "effect": "The next 4–8 times (selected at random) the target attempts to move, it is forced to repeat its last used move.  If the selected move allows the trainer to select a target, an opponent will be selected at random each turn.  If the target is prevented from using the selected move by some other effect, struggle will be used instead.  This effect ends if the selected move runs out of PP.\n\nIf the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, if it does not know the selected move, or if the selected move has 0 PP remaining, this move will fail.  If the target's last used move was encore, mimic, mirror move, sketch, struggle, or transform, this move will fail.",
                "level": 18
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 60,
                "name": "psybeam",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is attacked with a peculiar ray. This may\nalso leave the target confused.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 25
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "level": 29
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "level": 32
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "level": 36
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 39
            },
            {
                "id": 272,
                "name": "role-play",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user mimics the target completely, copying the\ntarget’s Ability.",
                "effect": "User's ability is replaced with the target's until the user leaves the field.  Ignores accuracy and evasion modifiers.\n\nIf the target has flower gift, forecast, illusion, imposter, multitype, stance change, trace, wonder guard, or zen mode, this move will fail.\n\nThis move cannot be copied by mirror move.",
                "level": 43
            },
            {
                "id": 226,
                "name": "baton-pass",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user switches places with a party Pokémon in\nwaiting and passes along any stat changes.",
                "effect": "User switches out, and the trainer selects a replacement Pokémon from the party.  Stat changes, confusion, and persistent move effects are passed along to the replacement Pokémon.\n\nThe following move effects are passed:\n\n* aqua ring\n* both the user's and target's effect of block, mean look, and spider web\n* the curse effect of curse\n* embargo\n* focus energy or an activated lansat berry\n* gastro acid\n* ingrain\n* being sapped by leech seed\n* being targeted by lock on or mind reader\n* magnet rise\n* perish song's counter\n* power trick\n* substitute; the doll's HP is unchanged\n\nThe replacement Pokémon does not trigger effects that respond to Pokémon switching in.",
                "level": 46
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 50
            }
        ],
        "egg": [
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep."
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore."
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 204,
                "name": "charm",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fairy",
                "damage_class": "status",
                "description": "The user gazes at the target rather charmingly,\nmaking it less wary. This harshly lowers the target’s\nAttack stat.",
                "effect": "Lowers the target's Attack by two stages."
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 252,
                "name": "fake-out",
                "power": 40,
                "accuracy": 100,
                "pp": 10,
                "priority": 3,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack hits first and makes the target flinch.\nIt only works the first turn each time the user\nenters battle.",
                "effect": "Inflicts regular damage.  Causes the target to flinch.  Can only be used on the user's first turn after entering the field."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 298,
                "name": "teeter-dance",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user performs a wobbly dance that confuses\nthe Pokémon around it.",
                "effect": "Confuses all targets."
            },
            {
                "id": 358,
                "name": "wake-up-slap",
                "power": 70,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target is sleeping, this move has double power, and the target wakes up."
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead."
            },
            {
                "id": 417,
                "name": "nasty-plot",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user stimulates its brain by thinking bad\nthoughts. This sharply raises the user’s Sp. Atk stat.",
                "effect": "Raises the user's Special Attack by two stages."
            },
            {
                "id": 471,
                "name": "power-split",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to average its\nAttack and Sp. Atk stats with those of the target.",
                "effect": "Averages the user's unmodified Attack with the target's unmodified Attack; the value becomes the unmodified Attack for both Pokémon. Unmodified Special Attack is averaged the same way.\n\nThis effect applies before any other persistent changes to unmodified Attack or Special Attack, such as flower gift during sunny day."
            },
            {
                "id": 478,
                "name": "magic-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nheld items lose their effects for five turns.",
                "effect": "For five turns (including this one), passive effects of held items are ignored, and Pokémon will not use their held items."
            }
        ],
        "tutor": [],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 148,
                "name": "flash",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's accuracy by one stage.",
                "machine": "tm70"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 611,
                "name": "infestation",
                "power": 20,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "The target is infested and attacked for four to five\nturns. The target can’t flee during this time.",
                "effect": "Inflicts regular damage.  For the next 2–5 turns, the target cannot leave the field and is damaged for 1/16 its max HP at the end of each turn.  The user continues to use other moves during this time.  If the user leaves the field, this effect ends.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.\n\nrapid spin cancels this effect.",
                "machine": "tm83"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "ultra-sun-ultra-moon": {
        "level-up": [
            {
                "id": 1,
                "name": "pound",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is physically pounded with a long tail, a\nforeleg, or the like.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 93,
                "name": "confusion",
                "power": 50,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a weak telekinetic force.\nThis may also confuse the target.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 1
            },
            {
                "id": 112,
                "name": "barrier",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Defense by two stages.",
                "level": 1
            },
            {
                "id": 321,
                "name": "tickle",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tickles the target into laughing, reducing its\nAttack and Defense stats.",
                "effect": "Lowers the target's Attack and Defense by one stage.",
                "level": 1
            },
            {
                "id": 383,
                "name": "copycat",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user mimics the move used immediately before\nit. The move fails if no other move has been\nused yet.",
                "effect": "Uses the last move that was used successfully by any Pokémon, including the user.\n\nThis move cannot copy itself, nor roar nor whirlwind.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "level": 4
            },
            {
                "id": 96,
                "name": "meditate",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Raises the user's Attack by one stage.",
                "level": 8
            },
            {
                "id": 3,
                "name": "double-slap",
                "power": 15,
                "accuracy": 85,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 11
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore.",
                "level": 15
            },
            {
                "id": 227,
                "name": "encore",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user compels the target to keep using the move\nit encored for three turns.",
                "effect": "The next 4–8 times (selected at random) the target attempts to move, it is forced to repeat its last used move.  If the selected move allows the trainer to select a target, an opponent will be selected at random each turn.  If the target is prevented from using the selected move by some other effect, struggle will be used instead.  This effect ends if the selected move runs out of PP.\n\nIf the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, if it does not know the selected move, or if the selected move has 0 PP remaining, this move will fail.  If the target's last used move was encore, mimic, mirror move, sketch, struggle, or transform, this move will fail.",
                "level": 18
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "level": 22
            },
            {
                "id": 60,
                "name": "psybeam",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is attacked with a peculiar ray. This may\nalso leave the target confused.",
                "effect": "Inflicts regular damage.  Has a 10% chance to confuse the target.",
                "level": 25
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "level": 29
            },
            {
                "id": 278,
                "name": "recycle",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user recycles a held item that has been used in\nbattle so it can be used again.",
                "effect": "User recovers the last item consumed by the user or a Pokémon in its position on the field.  The item must be used again before it can be recovered by this move again.  If the user is holding an item, this move fails.\n\nItems taken or given away by covet, knock off, switcheroo, thief, or trick may not be recovered.",
                "level": 32
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "level": 36
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "level": 39
            },
            {
                "id": 272,
                "name": "role-play",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user mimics the target completely, copying the\ntarget’s Ability.",
                "effect": "User's ability is replaced with the target's until the user leaves the field.  Ignores accuracy and evasion modifiers.\n\nIf the target has flower gift, forecast, illusion, imposter, multitype, stance change, trace, wonder guard, or zen mode, this move will fail.\n\nThis move cannot be copied by mirror move.",
                "level": 43
            },
            {
                "id": 226,
                "name": "baton-pass",
                "power": null,
                "accuracy": null,
                "pp": 40,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user switches places with a party Pokémon in\nwaiting and passes along any stat changes.",
                "effect": "User switches out, and the trainer selects a replacement Pokémon from the party.  Stat changes, confusion, and persistent move effects are passed along to the replacement Pokémon.\n\nThe following move effects are passed:\n\n* aqua ring\n* both the user's and target's effect of block, mean look, and spider web\n* the curse effect of curse\n* embargo\n* focus energy or an activated lansat berry\n* gastro acid\n* ingrain\n* being sapped by leech seed\n* being targeted by lock on or mind reader\n* magnet rise\n* perish song's counter\n* power trick\n* substitute; the doll's HP is unchanged\n\nThe replacement Pokémon does not trigger effects that respond to Pokémon switching in.",
                "level": 46
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "level": 50
            }
        ],
        "egg": [
            {
                "id": 95,
                "name": "hypnosis",
                "power": null,
                "accuracy": 60,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs hypnotic suggestion to make the\ntarget fall into a deep sleep.",
                "effect": "Puts the target to sleep."
            },
            {
                "id": 102,
                "name": "mimic",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user copies the target’s last move. The move\ncan be used during battle until the Pokémon is\nswitched out.",
                "effect": "This move is replaced by the target's last successfully used move, and its PP changes to 5.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if the user already knows the targeted move, this move will fail.  This effect vanishes when the user leaves the field.\n\nIf chatter, metronome, mimic, sketch, or struggle is selected, this move will fail.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome, nor forced by encore."
            },
            {
                "id": 109,
                "name": "confuse-ray",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The target is exposed to a sinister ray that\ntriggers confusion.",
                "effect": "Confuses the target."
            },
            {
                "id": 196,
                "name": "icy-wind",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "ice",
                "damage_class": "special",
                "description": "The user attacks with a gust of chilled air. This also\nlowers opposing Pokémon’s Speed stats.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Speed by one stage."
            },
            {
                "id": 204,
                "name": "charm",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "fairy",
                "damage_class": "status",
                "description": "The user gazes at the target rather charmingly,\nmaking it less wary. This harshly lowers the target’s\nAttack stat.",
                "effect": "Lowers the target's Attack by two stages."
            },
            {
                "id": 248,
                "name": "future-sight",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "Two turns after this move is used, a hunk of psychic\nenergy attacks the target.",
                "effect": "Inflicts typeless regular damage at the end of the third turn, starting with this one.  This move cannot score a critical hit.  If the target switches out, its replacement will be hit instead.  Damage is calculated at the time this move is used; stat changes and switching out during the delay won't change the damage inflicted.  No move with this effect can be used against the same target again until after the end of the third turn.\n\nThis effect breaks through wonder guard.\n\nIf the target is protected by protect or detect on the turn this move is used, this move will fail.  However, the damage on the third turn will break through protection.\n\nThe damage is applied at the end of the turn, so it ignores endure and focus sash.\n\nThis move cannot be copied by mirror move."
            },
            {
                "id": 252,
                "name": "fake-out",
                "power": 40,
                "accuracy": 100,
                "pp": 10,
                "priority": 3,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack hits first and makes the target flinch.\nIt only works the first turn each time the user\nenters battle.",
                "effect": "Inflicts regular damage.  Causes the target to flinch.  Can only be used on the user's first turn after entering the field."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 298,
                "name": "teeter-dance",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user performs a wobbly dance that confuses\nthe Pokémon around it.",
                "effect": "Confuses all targets."
            },
            {
                "id": 358,
                "name": "wake-up-slap",
                "power": 70,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target is sleeping, this move has double power, and the target wakes up."
            },
            {
                "id": 361,
                "name": "healing-wish",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user faints. In return, the Pokémon taking its\nplace will have its HP restored and status\nconditions cured.",
                "effect": "User faints.  Its replacement's HP is fully restored, and any major status effect is removed.  If the replacement Pokémon is immediately fainted by a switch-in effect, the next replacement is healed by this move instead."
            },
            {
                "id": 417,
                "name": "nasty-plot",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user stimulates its brain by thinking bad\nthoughts. This sharply raises the user’s Sp. Atk stat.",
                "effect": "Raises the user's Special Attack by two stages."
            },
            {
                "id": 471,
                "name": "power-split",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user employs its psychic power to average its\nAttack and Sp. Atk stats with those of the target.",
                "effect": "Averages the user's unmodified Attack with the target's unmodified Attack; the value becomes the unmodified Attack for both Pokémon. Unmodified Special Attack is averaged the same way.\n\nThis effect applies before any other persistent changes to unmodified Attack or Special Attack, such as flower gift during sunny day."
            },
            {
                "id": 478,
                "name": "magic-room",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which Pokémon’s\nheld items lose their effects for five turns.",
                "effect": "For five turns (including this one), passive effects of held items are ignored, and Pokémon will not use their held items."
            },
            {
                "id": 678,
                "name": "psychic-terrain",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "This protects Pokémon on the ground from priority\nmoves and powers up Psychic-type moves for\nfive turns.",
                "effect": "Changes the terrain to Psychic Terrain for 5 turns.  Overrides electric terrain, grassy terrain, and misty terrain.\n\nAll Pokémon on the ground are immune to moves with priority greater than 0.  (Moves that target the field rather than individual Pokémon, such as spikes, are not affected.)  Additionally, when a Pokémon on the ground uses a psychic-type move, that move's power is increased to 1.5×.\n\nIf a Pokémon is holding a Terrain Extender when creating Psychic Terrain (by any means), the effect lasts for 8 turns instead of 5."
            }
        ],
        "tutor": [],
        "machine": [
            {
                "id": 473,
                "name": "psyshock",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user materializes an odd psychic wave to attack\nthe target. This attack does physical damage.",
                "effect": "Inflicts regular damage.  Damage calculation always uses the target's Defense, regardless of this move's damage class.",
                "machine": "tm03"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 113,
                "name": "light-screen",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom special attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from special attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm16"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 219,
                "name": "safeguard",
                "power": null,
                "accuracy": null,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a protective field that prevents\nstatus conditions for five turns.",
                "effect": "Protects Pokémon on the user's side of the field from major status effects and confusion for five turns.  Does not cancel existing ailments.  This effect remains even if the user leaves the field.\n\nIf yawn is used while this move is in effect, it will immediately fail.\n\ndefog used by an opponent will end this effect.\n\nThis effect does not prevent the confusion caused by outrage, petal dance, or thrash.",
                "machine": "tm20"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 76,
                "name": "solar-beam",
                "power": 120,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "In this two-turn attack, the user gathers light, then\nblasts a bundled beam on the next turn.",
                "effect": "Inflicts regular damage.  User charges for one turn before attacking.\n\nDuring sunny day, the charge turn is skipped.\n\nDuring hail, rain dance, or sandstorm, power is halved.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm22"
            },
            {
                "id": 85,
                "name": "thunderbolt",
                "power": 90,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A strong electric blast crashes down on the target.\nThis may also leave the target with paralysis.",
                "effect": "Inflicts regular damage.  Has a 10% chance to paralyze the target.",
                "machine": "tm24"
            },
            {
                "id": 87,
                "name": "thunder",
                "power": 110,
                "accuracy": 70,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "A wicked thunderbolt is dropped on the target to\ninflict damage. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  Has a 30% chance to paralyze the target.\n\nDuring rain dance, this move has 100% accuracy.  It also has a (100 - accuracy)% chance to break through the protection of protect and detect.\n\nDuring sunny day, this move has 50% accuracy.",
                "machine": "tm25"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 94,
                "name": "psychic",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The target is hit by a strong telekinetic force.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 10% chance to lower the target's Special Defense by one stage.",
                "machine": "tm29"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 280,
                "name": "brick-break",
                "power": 75,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fighting",
                "damage_class": "physical",
                "description": "The user attacks with a swift chop. It can also break\nbarriers, such as Light Screen and Reflect.",
                "effect": "Destroys any light screen or reflect on the target's side of the field, then inflicts regular damage.",
                "machine": "tm31"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 115,
                "name": "reflect",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "A wondrous wall of light is put up to reduce damage\nfrom physical attacks for five turns.",
                "effect": "Erects a barrier around the user's side of the field that reduces damage from physical attacks by half for five turns.  In double battles, the reduction is 1/3.  Critical hits are not affected by the barrier.\n\nIf the user is holding light clay, the barrier lasts for eight turns.\n\nbrick break or defog used by an opponent will destroy the barrier.",
                "machine": "tm33"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 451,
                "name": "charge-beam",
                "power": 50,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "electric",
                "damage_class": "special",
                "description": "The user attacks the target with an electric charge. The\nuser may use any remaining electricity to raise its\nSp. Atk stat.",
                "effect": "Inflicts regular damage.  Has a 70% chance to raise the user's Special Attack by one stage.",
                "machine": "tm57"
            },
            {
                "id": 86,
                "name": "thunder-wave",
                "power": null,
                "accuracy": 90,
                "pp": 20,
                "priority": 0,
                "type": "electric",
                "damage_class": "status",
                "description": "The user launches a weak jolt of electricity that\nparalyzes the target.",
                "effect": "Paralyzes the target.",
                "machine": "tm73"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 611,
                "name": "infestation",
                "power": 20,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "special",
                "description": "The target is infested and attacked for four to five\nturns. The target can’t flee during this time.",
                "effect": "Inflicts regular damage.  For the next 2–5 turns, the target cannot leave the field and is damaged for 1/16 its max HP at the end of each turn.  The user continues to use other moves during this time.  If the user leaves the field, this effect ends.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.\n\nrapid spin cancels this effect.",
                "machine": "tm83"
            },
            {
                "id": 138,
                "name": "dream-eater",
                "power": 100,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user eats the dreams of a sleeping target.\nThe user’s HP is restored by half the damage taken by\nthe target.",
                "effect": "Fails if not used on a sleeping Pokémon.  Inflicts regular damage.  Drains half the damage inflicted to heal the user.",
                "machine": "tm85"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 433,
                "name": "trick-room",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": -7,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user creates a bizarre area in which slower\nPokémon get to move first for five turns.",
                "effect": "For five turns (including this one), slower Pokémon will act before faster Pokémon.  Move priority is not affected.  Using this move when its effect is already active will end the effect.\n\nPokémon holding full incense, lagging tail, or quick claw and Pokémon with stall ignore this effect.",
                "machine": "tm92"
            }
        ]
    },
    "sword-shield": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    }
}