{
    "i": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "ii": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "iii": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "iv": {
        "level-up": [],
        "egg": [],
        "tutor": [],
        "machine": []
    },
    "v": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 43,
                "name": "leer",
                "power": null,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user gives opposing Pokémon an intimidating\nleer that lowers the Defense stat.",
                "effect": "Lowers the target's Defense by one stage.",
                "level": 1
            },
            {
                "id": 228,
                "name": "pursuit",
                "power": 40,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target attempts to switch out this turn before the user acts, this move hits the target before it leaves and has double power.\n\nThis effect can still hit a Pokémon that switches out when it has a substitute up or when an ally has used follow me.",
                "level": 5
            },
            {
                "id": 313,
                "name": "fake-tears",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user feigns crying to fluster the target, harshly\nlowering its Sp. Def stat.",
                "effect": "Lowers the target's Special Defense by two stages.",
                "level": 9
            },
            {
                "id": 154,
                "name": "fury-swipes",
                "power": 18,
                "accuracy": 80,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is raked with sharp claws or scythes\nquickly two to five times in a row.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 13
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 17
            },
            {
                "id": 184,
                "name": "scary-face",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user frightens the target with a scary face to\nharshly lower its Speed stat.",
                "effect": "Lowers the target's Speed by two stages.",
                "level": 21
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "level": 25
            },
            {
                "id": 492,
                "name": "foul-play",
                "power": 95,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user turns the target’s power against it.\nThe higher the target’s Attack stat, the greater\nthe damage it deals.",
                "effect": "Inflicts regular damage.  Damage is calculated using the target's attacking stat rather than the user's.",
                "level": 29
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "level": 33
            },
            {
                "id": 97,
                "name": "agility",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user relaxes and lightens its body to move\nfaster. This sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "level": 37
            },
            {
                "id": 373,
                "name": "embargo",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Target cannot use its held item for five turns.  If the target leaves the field, this effect ends.\n\nIf a Pokémon under this effect uses bug bite or pluck on a Pokémon holding a berry, the berry is destroyed but not used.  If a Pokémon under this effect uses fling, it will fail.\n\nThis effect is passed by baton pass.",
                "level": 41
            },
            {
                "id": 386,
                "name": "punishment",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power starts at 60 and is increased by 20 for every stage any of the target's stats has been raised, capping at 200.  Accuracy and evasion modifiers do not increase this move's power.",
                "level": 45
            },
            {
                "id": 417,
                "name": "nasty-plot",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user stimulates its brain by thinking bad\nthoughts. This sharply raises the user’s Sp. Atk stat.",
                "effect": "Raises the user's Special Attack by two stages.",
                "level": 49
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 53
            },
            {
                "id": 539,
                "name": "night-daze",
                "power": 85,
                "accuracy": 95,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user lets loose a pitch-black shock wave at its\ntarget. This may also lower the target’s accuracy.",
                "effect": "Inflicts regular damage.  Has a 40% chance to lower the target's accuracy by one stage.",
                "level": 57
            }
        ],
        "egg": [
            {
                "id": 68,
                "name": "counter",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": -5,
                "type": "fighting",
                "damage_class": "physical",
                "description": "A retaliation move that counters any physical attack,\ninflicting double the damage taken.",
                "effect": "Targets the last opposing Pokémon to hit the user with a physical move this turn.  Inflicts twice the damage that move did to the user.  If there is no eligible target, this move will fail.  Type immunity applies, but other type effects are ignored.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 197,
                "name": "detect",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 4,
                "type": "fighting",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 262,
                "name": "memento",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user faints when using this move. In return, this\nharshly lowers the target’s Attack and Sp. Atk stats.",
                "effect": "Lowers the target's Attack and Special Attack by two stages.  User faints."
            },
            {
                "id": 289,
                "name": "snatch",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "The next time a Pokémon uses a beneficial move on itself or itself and its ally this turn, the user of this move will steal the move and use it itself.  Moves which may be stolen by this move are identified by the \"snatchable\" flag.\n\nIf two Pokémon use this move on the same turn, the faster Pokémon will steal the first beneficial move, and the slower Pokémon will then steal it again—thus, only the slowest Pokémon using this move ultimately gains a stolen move's effect.\n\nIf the user steals psych up, it will target the Pokémon that used psych up.  If the user was the original target of psych up, and the Pokémon that originally used it's affected by pressure, it will only lose 1 PP.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch."
            },
            {
                "id": 389,
                "name": "sucker-punch",
                "power": 70,
                "accuracy": 100,
                "pp": 5,
                "priority": 1,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move enables the user to attack first. This move\nfails if the target is not readying an attack.",
                "effect": "Inflicts regular damage.  If the target has not selected a damaging move this turn, or if the target has already acted this turn, this move will fail.\n\nThis move is not affected by iron fist."
            },
            {
                "id": 399,
                "name": "dark-pulse",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user releases a horrible aura imbued with dark\nthoughts. This may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch."
            },
            {
                "id": 445,
                "name": "captivate",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's Special Attack by two stages.  If the user and target are the same gender, or either is genderless, this move will fail."
            }
        ],
        "tutor": [
            {
                "id": 173,
                "name": "snore",
                "power": 50,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This attack can be used only if the user is asleep.\nThe harsh noise may also make the target flinch.",
                "effect": "Only usable if the user is sleeping.  Inflicts regular damage.  Has a 30% chance to make the target flinch."
            },
            {
                "id": 180,
                "name": "spite",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ghost",
                "damage_class": "status",
                "description": "The user unleashes its grudge on the move last used\nby the target by cutting 4 PP from it.",
                "effect": "Lowers the PP of the target's last used move by 4.  If the target hasn't used a move since entering the field, if it tried to use a move this turn and failed, or if its last used move has 0 PP remaining, this move will fail."
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 253,
                "name": "uproar",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks in an uproar for three turns.\nDuring that time, no Pokémon can fall asleep.",
                "effect": "Inflicts regular damage.  User is forced to use this move for 2–5 turns, selected at random.  All Pokémon on the field wake up, and none can fall to sleep until the lock-in ends.\n\nPokémon cannot use rest during this effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 271,
                "name": "trick",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user catches the target off guard and swaps its\nheld item with its own.",
                "effect": "User and target permanently swap held items.  Works even if one of the Pokémon isn't holding anything.  If either Pokémon is holding mail, this move will fail.\n\nIf either Pokémon has multitype or sticky hold, this move will fail.\n\nIf this move results in a Pokémon obtaining choice band, choice scarf, or choice specs, and that Pokémon was the latter of the pair to move this turn, then the move it used this turn becomes its chosen forced move.  This applies even if both Pokémon had a choice item before this move was used.  If the first of the two Pokémon gains a choice item, it may select whatever choice move it wishes next turn.\n\nNeither the user nor the target can recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 282,
                "name": "knock-off",
                "power": 65,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user slaps down the target’s held item, and that\nitem can’t be used in that battle. The move does\nmore damage if the target has a held item.",
                "effect": "Inflicts regular damage.  Target loses its held item.\n\nNeither the user nor the target can recover its item with recycle.\n\nIf the target has multitype or sticky hold, it will take damage but not lose its item."
            },
            {
                "id": 289,
                "name": "snatch",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "The next time a Pokémon uses a beneficial move on itself or itself and its ally this turn, the user of this move will steal the move and use it itself.  Moves which may be stolen by this move are identified by the \"snatchable\" flag.\n\nIf two Pokémon use this move on the same turn, the faster Pokémon will steal the first beneficial move, and the slower Pokémon will then steal it again—thus, only the slowest Pokémon using this move ultimately gains a stolen move's effect.\n\nIf the user steals psych up, it will target the Pokémon that used psych up.  If the user was the original target of psych up, and the Pokémon that originally used it's affected by pressure, it will only lose 1 PP.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 304,
                "name": "hyper-voice",
                "power": 90,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user lets loose a horribly echoing shout with\nthe power to inflict damage.",
                "effect": "Inflicts regular damage."
            },
            {
                "id": 340,
                "name": "bounce",
                "power": 85,
                "accuracy": 85,
                "pp": 5,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user bounces up high, then drops on the target\non the second turn. This may also leave the target\nwith paralysis.",
                "effect": "Inflicts regular damage.  User bounces high into the air for one turn, becoming immune to attack, and hits on the second turn.  Has a 30% chance to paralyze the target.\n\nDuring the immune turn, gust, hurricane, sky uppercut, smack down, thunder, and twister still hit the user normally.  gust and twister also have double power against the user.\n\nThe damage from hail and sandstorm still applies during the immune turn.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be used while gravity is in effect.\n\nThis move cannot be selected by sleep talk."
            },
            {
                "id": 343,
                "name": "covet",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user endearingly approaches the target, then\nsteals the target’s held item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 399,
                "name": "dark-pulse",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user releases a horrible aura imbued with dark\nthoughts. This may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch."
            },
            {
                "id": 492,
                "name": "foul-play",
                "power": 95,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user turns the target’s power against it.\nThe higher the target’s Attack stat, the greater\nthe damage it deals.",
                "effect": "Inflicts regular damage.  Damage is calculated using the target's attacking stat rather than the user's."
            }
        ],
        "machine": [
            {
                "id": 15,
                "name": "cut",
                "power": 50,
                "accuracy": 95,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is cut with a scythe or claw.",
                "effect": "Inflicts regular damage.",
                "machine": "hm01"
            },
            {
                "id": 468,
                "name": "hone-claws",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user sharpens its claws to boost its Attack stat\nand accuracy.",
                "effect": "Raises the user's Attack and accuracy by one stage.",
                "machine": "tm01"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 46,
                "name": "roar",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": -6,
                "type": "normal",
                "damage_class": "status",
                "description": "The target is scared off, and a different Pokémon is\ndragged out. In the wild, this ends a battle against a\nsingle Pokémon.",
                "effect": "Switches the target out for another of its trainer's Pokémon selected at random.  Wild battles end immediately.\n\nDoesn't affect Pokémon with suction cups or under the effect of ingrain.",
                "machine": "tm05"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 91,
                "name": "dig",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user burrows into the ground, then attacks on\nthe next turn.",
                "effect": "Inflicts regular damage.  User digs underground for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, earthquake, fissure, and magnitude still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm28"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 510,
                "name": "incinerate",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks opposing Pokémon with fire.\nIf a Pokémon is holding a certain item, such as a\nBerry, the item becomes burned up and unusable.",
                "effect": "Inflicts regular damage.  If the target is holding a berry, it's destroyed and cannot be used in response to this move.",
                "machine": "tm59"
            },
            {
                "id": 373,
                "name": "embargo",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Target cannot use its held item for five turns.  If the target leaves the field, this effect ends.\n\nIf a Pokémon under this effect uses bug bite or pluck on a Pokémon holding a berry, the berry is destroyed but not used.  If a Pokémon under this effect uses fling, it will fail.\n\nThis effect is passed by baton pass.",
                "machine": "tm63"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 514,
                "name": "retaliate",
                "power": 70,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user gets revenge for a fainted ally. If an ally\nfainted in the previous turn, this move’s power\nis increased.",
                "effect": "Inflicts regular damage.  If a friendly Pokémon fainted on the previous turn, this move has double power.",
                "machine": "tm67"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 555,
                "name": "snarl",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user yells as if it’s ranting about something,\nwhich lowers the Sp. Atk stats of opposing Pokémon.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Special Attack by one stage.",
                "machine": "tm95"
            }
        ]
    },
    "vi": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 43,
                "name": "leer",
                "power": null,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user gives opposing Pokémon an intimidating\nleer that lowers the Defense stat.",
                "effect": "Lowers the target's Defense by one stage.",
                "level": 1
            },
            {
                "id": 228,
                "name": "pursuit",
                "power": 40,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target attempts to switch out this turn before the user acts, this move hits the target before it leaves and has double power.\n\nThis effect can still hit a Pokémon that switches out when it has a substitute up or when an ally has used follow me.",
                "level": 5
            },
            {
                "id": 313,
                "name": "fake-tears",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user feigns crying to fluster the target, harshly\nlowering its Sp. Def stat.",
                "effect": "Lowers the target's Special Defense by two stages.",
                "level": 9
            },
            {
                "id": 154,
                "name": "fury-swipes",
                "power": 18,
                "accuracy": 80,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is raked with sharp claws or scythes\nquickly two to five times in a row.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 13
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 17
            },
            {
                "id": 184,
                "name": "scary-face",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user frightens the target with a scary face to\nharshly lower its Speed stat.",
                "effect": "Lowers the target's Speed by two stages.",
                "level": 21
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "level": 25
            },
            {
                "id": 492,
                "name": "foul-play",
                "power": 95,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user turns the target’s power against it.\nThe higher the target’s Attack stat, the greater\nthe damage it deals.",
                "effect": "Inflicts regular damage.  Damage is calculated using the target's attacking stat rather than the user's.",
                "level": 29
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "level": 33
            },
            {
                "id": 97,
                "name": "agility",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user relaxes and lightens its body to move\nfaster. This sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "level": 37
            },
            {
                "id": 373,
                "name": "embargo",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Target cannot use its held item for five turns.  If the target leaves the field, this effect ends.\n\nIf a Pokémon under this effect uses bug bite or pluck on a Pokémon holding a berry, the berry is destroyed but not used.  If a Pokémon under this effect uses fling, it will fail.\n\nThis effect is passed by baton pass.",
                "level": 41
            },
            {
                "id": 386,
                "name": "punishment",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power starts at 60 and is increased by 20 for every stage any of the target's stats has been raised, capping at 200.  Accuracy and evasion modifiers do not increase this move's power.",
                "level": 45
            },
            {
                "id": 417,
                "name": "nasty-plot",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user stimulates its brain by thinking bad\nthoughts. This sharply raises the user’s Sp. Atk stat.",
                "effect": "Raises the user's Special Attack by two stages.",
                "level": 49
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 53
            },
            {
                "id": 539,
                "name": "night-daze",
                "power": 85,
                "accuracy": 95,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user lets loose a pitch-black shock wave at its\ntarget. This may also lower the target’s accuracy.",
                "effect": "Inflicts regular damage.  Has a 40% chance to lower the target's accuracy by one stage.",
                "level": 57
            }
        ],
        "egg": [
            {
                "id": 68,
                "name": "counter",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": -5,
                "type": "fighting",
                "damage_class": "physical",
                "description": "A retaliation move that counters any physical attack,\ninflicting double the damage taken.",
                "effect": "Targets the last opposing Pokémon to hit the user with a physical move this turn.  Inflicts twice the damage that move did to the user.  If there is no eligible target, this move will fail.  Type immunity applies, but other type effects are ignored.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 197,
                "name": "detect",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 4,
                "type": "fighting",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 262,
                "name": "memento",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user faints when using this move. In return, this\nharshly lowers the target’s Attack and Sp. Atk stats.",
                "effect": "Lowers the target's Attack and Special Attack by two stages.  User faints."
            },
            {
                "id": 289,
                "name": "snatch",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "The next time a Pokémon uses a beneficial move on itself or itself and its ally this turn, the user of this move will steal the move and use it itself.  Moves which may be stolen by this move are identified by the \"snatchable\" flag.\n\nIf two Pokémon use this move on the same turn, the faster Pokémon will steal the first beneficial move, and the slower Pokémon will then steal it again—thus, only the slowest Pokémon using this move ultimately gains a stolen move's effect.\n\nIf the user steals psych up, it will target the Pokémon that used psych up.  If the user was the original target of psych up, and the Pokémon that originally used it's affected by pressure, it will only lose 1 PP.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch."
            },
            {
                "id": 383,
                "name": "copycat",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user mimics the move used immediately before\nit. The move fails if no other move has been\nused yet.",
                "effect": "Uses the last move that was used successfully by any Pokémon, including the user.\n\nThis move cannot copy itself, nor roar nor whirlwind.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 389,
                "name": "sucker-punch",
                "power": 70,
                "accuracy": 100,
                "pp": 5,
                "priority": 1,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move enables the user to attack first. This move\nfails if the target is not readying an attack.",
                "effect": "Inflicts regular damage.  If the target has not selected a damaging move this turn, or if the target has already acted this turn, this move will fail.\n\nThis move is not affected by iron fist."
            },
            {
                "id": 399,
                "name": "dark-pulse",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user releases a horrible aura imbued with dark\nthoughts. This may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch."
            },
            {
                "id": 445,
                "name": "captivate",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's Special Attack by two stages.  If the user and target are the same gender, or either is genderless, this move will fail."
            }
        ],
        "tutor": [],
        "machine": [
            {
                "id": 15,
                "name": "cut",
                "power": 50,
                "accuracy": 95,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is cut with a scythe or claw.",
                "effect": "Inflicts regular damage.",
                "machine": "hm01"
            },
            {
                "id": 468,
                "name": "hone-claws",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user sharpens its claws to boost its Attack stat\nand accuracy.",
                "effect": "Raises the user's Attack and accuracy by one stage.",
                "machine": "tm01"
            },
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 46,
                "name": "roar",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": -6,
                "type": "normal",
                "damage_class": "status",
                "description": "The target is scared off, and a different Pokémon is\ndragged out. In the wild, this ends a battle against a\nsingle Pokémon.",
                "effect": "Switches the target out for another of its trainer's Pokémon selected at random.  Wild battles end immediately.\n\nDoesn't affect Pokémon with suction cups or under the effect of ingrain.",
                "machine": "tm05"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 91,
                "name": "dig",
                "power": 80,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "ground",
                "damage_class": "physical",
                "description": "The user burrows into the ground, then attacks on\nthe next turn.",
                "effect": "Inflicts regular damage.  User digs underground for one turn, becoming immune to attack, and hits on the second turn.\n\nDuring the immune turn, earthquake, fissure, and magnitude still hit the user normally, and their power is doubled if appropriate.\n\nThe user may be hit during its immune turn if under the effect of lock on, mind reader, or no guard.\n\nThis move cannot be selected by sleep talk.",
                "machine": "tm28"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 510,
                "name": "incinerate",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "fire",
                "damage_class": "special",
                "description": "The user attacks opposing Pokémon with fire.\nIf a Pokémon is holding a certain item, such as a\nBerry, the item becomes burned up and unusable.",
                "effect": "Inflicts regular damage.  If the target is holding a berry, it's destroyed and cannot be used in response to this move.",
                "machine": "tm59"
            },
            {
                "id": 373,
                "name": "embargo",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Target cannot use its held item for five turns.  If the target leaves the field, this effect ends.\n\nIf a Pokémon under this effect uses bug bite or pluck on a Pokémon holding a berry, the berry is destroyed but not used.  If a Pokémon under this effect uses fling, it will fail.\n\nThis effect is passed by baton pass.",
                "machine": "tm63"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 514,
                "name": "retaliate",
                "power": 70,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The user gets revenge for a fainted ally. If an ally\nfainted in the previous turn, this move’s power\nis increased.",
                "effect": "Inflicts regular damage.  If a friendly Pokémon fainted on the previous turn, this move has double power.",
                "machine": "tm67"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 555,
                "name": "snarl",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user yells as if it’s ranting about something,\nwhich lowers the Sp. Atk stats of opposing Pokémon.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Special Attack by one stage.",
                "machine": "tm95"
            },
            {
                "id": 399,
                "name": "dark-pulse",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user releases a horrible aura imbued with dark\nthoughts. This may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
                "machine": "tm97"
            }
        ]
    },
    "vii": {
        "level-up": [
            {
                "id": 10,
                "name": "scratch",
                "power": 40,
                "accuracy": 100,
                "pp": 35,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "Hard, pointed, sharp claws rake the target to\ninflict damage.",
                "effect": "Inflicts regular damage.",
                "level": 1
            },
            {
                "id": 43,
                "name": "leer",
                "power": null,
                "accuracy": 100,
                "pp": 30,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user gives opposing Pokémon an intimidating\nleer that lowers the Defense stat.",
                "effect": "Lowers the target's Defense by one stage.",
                "level": 1
            },
            {
                "id": 228,
                "name": "pursuit",
                "power": 40,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  If the target attempts to switch out this turn before the user acts, this move hits the target before it leaves and has double power.\n\nThis effect can still hit a Pokémon that switches out when it has a substitute up or when an ally has used follow me.",
                "level": 5
            },
            {
                "id": 313,
                "name": "fake-tears",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user feigns crying to fluster the target, harshly\nlowering its Sp. Def stat.",
                "effect": "Lowers the target's Special Defense by two stages.",
                "level": 9
            },
            {
                "id": 154,
                "name": "fury-swipes",
                "power": 18,
                "accuracy": 80,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "The target is raked with sharp claws or scythes\nquickly two to five times in a row.",
                "effect": "Inflicts regular damage.  Hits 2–5 times in one turn.\n\nHas a 3/8 chance each to hit 2 or 3 times, and a 1/8 chance each to hit 4 or 5 times.  Averages to 3 hits per use.",
                "level": 13
            },
            {
                "id": 185,
                "name": "feint-attack",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "level": 17
            },
            {
                "id": 184,
                "name": "scary-face",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user frightens the target with a scary face to\nharshly lower its Speed stat.",
                "effect": "Lowers the target's Speed by two stages.",
                "level": 21
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "level": 25
            },
            {
                "id": 492,
                "name": "foul-play",
                "power": 95,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user turns the target’s power against it.\nThe higher the target’s Attack stat, the greater\nthe damage it deals.",
                "effect": "Inflicts regular damage.  Damage is calculated using the target's attacking stat rather than the user's.",
                "level": 29
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "level": 33
            },
            {
                "id": 97,
                "name": "agility",
                "power": null,
                "accuracy": null,
                "pp": 30,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user relaxes and lightens its body to move\nfaster. This sharply raises the Speed stat.",
                "effect": "Raises the user's Speed by two stages.",
                "level": 37
            },
            {
                "id": 373,
                "name": "embargo",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Target cannot use its held item for five turns.  If the target leaves the field, this effect ends.\n\nIf a Pokémon under this effect uses bug bite or pluck on a Pokémon holding a berry, the berry is destroyed but not used.  If a Pokémon under this effect uses fling, it will fail.\n\nThis effect is passed by baton pass.",
                "level": 41
            },
            {
                "id": 386,
                "name": "punishment",
                "power": null,
                "accuracy": 100,
                "pp": 5,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power starts at 60 and is increased by 20 for every stage any of the target's stats has been raised, capping at 200.  Accuracy and evasion modifiers do not increase this move's power.",
                "level": 45
            },
            {
                "id": 417,
                "name": "nasty-plot",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user stimulates its brain by thinking bad\nthoughts. This sharply raises the user’s Sp. Atk stat.",
                "effect": "Raises the user's Special Attack by two stages.",
                "level": 49
            },
            {
                "id": 286,
                "name": "imprison",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "If opposing Pokémon know any move also known by\nthe user, they are prevented from using it.",
                "effect": "Prevents any Pokémon on the opposing side of the field from using any move the user knows until the user leaves the field.  This effect is live; if the user obtains new moves while on the field, these moves become restricted.  If no opposing Pokémon knows any of the user's moves when this move is used, this move will fail.",
                "level": 53
            },
            {
                "id": 539,
                "name": "night-daze",
                "power": 85,
                "accuracy": 95,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user lets loose a pitch-black shock wave at its\ntarget. This may also lower the target’s accuracy.",
                "effect": "Inflicts regular damage.  Has a 40% chance to lower the target's accuracy by one stage.",
                "level": 57
            }
        ],
        "egg": [
            {
                "id": 68,
                "name": "counter",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": -5,
                "type": "fighting",
                "damage_class": "physical",
                "description": "A retaliation move that counters any physical attack,\ninflicting double the damage taken.",
                "effect": "Targets the last opposing Pokémon to hit the user with a physical move this turn.  Inflicts twice the damage that move did to the user.  If there is no eligible target, this move will fail.  Type immunity applies, but other type effects are ignored.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 197,
                "name": "detect",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 4,
                "type": "fighting",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome."
            },
            {
                "id": 262,
                "name": "memento",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user faints when using this move. In return, this\nharshly lowers the target’s Attack and Sp. Atk stats.",
                "effect": "Lowers the target's Attack and Special Attack by two stages.  User faints."
            },
            {
                "id": 289,
                "name": "snatch",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "The next time a Pokémon uses a beneficial move on itself or itself and its ally this turn, the user of this move will steal the move and use it itself.  Moves which may be stolen by this move are identified by the \"snatchable\" flag.\n\nIf two Pokémon use this move on the same turn, the faster Pokémon will steal the first beneficial move, and the slower Pokémon will then steal it again—thus, only the slowest Pokémon using this move ultimately gains a stolen move's effect.\n\nIf the user steals psych up, it will target the Pokémon that used psych up.  If the user was the original target of psych up, and the Pokémon that originally used it's affected by pressure, it will only lose 1 PP.\n\nThis move cannot be copied by mirror move, nor selected by assist or metronome."
            },
            {
                "id": 326,
                "name": "extrasensory",
                "power": 80,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "special",
                "description": "The user attacks with an odd, unseeable power.\nThis may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 10% chance to make the target flinch."
            },
            {
                "id": 383,
                "name": "copycat",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user mimics the move used immediately before\nit. The move fails if no other move has been\nused yet.",
                "effect": "Uses the last move that was used successfully by any Pokémon, including the user.\n\nThis move cannot copy itself, nor roar nor whirlwind.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk."
            },
            {
                "id": 389,
                "name": "sucker-punch",
                "power": 70,
                "accuracy": 100,
                "pp": 5,
                "priority": 1,
                "type": "dark",
                "damage_class": "physical",
                "description": "This move enables the user to attack first. This move\nfails if the target is not readying an attack.",
                "effect": "Inflicts regular damage.  If the target has not selected a damaging move this turn, or if the target has already acted this turn, this move will fail.\n\nThis move is not affected by iron fist."
            },
            {
                "id": 399,
                "name": "dark-pulse",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user releases a horrible aura imbued with dark\nthoughts. This may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch."
            },
            {
                "id": 445,
                "name": "captivate",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Lowers the target's Special Attack by two stages.  If the user and target are the same gender, or either is genderless, this move will fail."
            }
        ],
        "tutor": [],
        "machine": [
            {
                "id": 347,
                "name": "calm-mind",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user quietly focuses its mind and calms its\nspirit to raise its Sp. Atk and Sp. Def stats.",
                "effect": "Raises the user's Special Attack and Special Defense by one stage each.",
                "machine": "tm04"
            },
            {
                "id": 46,
                "name": "roar",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": -6,
                "type": "normal",
                "damage_class": "status",
                "description": "The target is scared off, and a different Pokémon is\ndragged out. In the wild, this ends a battle against a\nsingle Pokémon.",
                "effect": "Switches the target out for another of its trainer's Pokémon selected at random.  Wild battles end immediately.\n\nDoesn't affect Pokémon with suction cups or under the effect of ingrain.",
                "machine": "tm05"
            },
            {
                "id": 92,
                "name": "toxic",
                "power": null,
                "accuracy": 90,
                "pp": 10,
                "priority": 0,
                "type": "poison",
                "damage_class": "status",
                "description": "A move that leaves the target badly poisoned.\nIts poison damage worsens every turn.",
                "effect": "Badly poisons the target.  Never misses when used by a poison-type Pokémon.",
                "machine": "tm06"
            },
            {
                "id": 237,
                "name": "hidden-power",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's IVs.\n\nPower is given by `x * 40 / 63 + 30`.  `x` is obtained by arranging bit 1 from the IV for each of Special Defense, Special Attack, Speed, Defense, Attack, and HP in that order.  (Bit 1 is 1 if the IV is of the form `4n + 2` or `4n + 3`.  `x` is then 64 * Special Defense IV bit 1, plus 32 * Special Attack IV bit 1, etc.)\n\nPower is always between 30 and 70, inclusive.  Average power is 49.5.\n\nType is given by `y * 15 / 63`, where `y` is similar to `x` above, except constructed from bit 0.  (Bit 0 is 1 if the IV is odd.)  The result is looked up in the following table.\n\nValue | Type\n----: | --------\n    0 | fighting\n    1 | flying\n    2 | poison\n    3 | ground\n    4 | rock\n    5 | bug\n    6 | ghost\n    7 | steel\n    8 | fire\n    9 | water\n   10 | grass\n   11 | electric\n   12 | psychic\n   13 | ice\n   14 | dragon\n   15 | dark\n\nThis move thus cannot be normal.  Most other types have an equal 1/16 chance to be selected, given random IVs.  However, due to the flooring used here, bug, fighting, and grass appear 5/64 of the time, and dark only 1/64 of the time.",
                "machine": "tm10"
            },
            {
                "id": 590,
                "name": "confide",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user tells the target a secret, and the target\nloses its ability to concentrate. This lowers\nthe target’s Sp. Atk stat.",
                "effect": "Lowers the target's Special Attack by one stage.",
                "machine": "tm100"
            },
            {
                "id": 241,
                "name": "sunny-day",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "fire",
                "damage_class": "status",
                "description": "The user intensifies the sun for five turns, powering\nup Fire-type moves. It lowers the power of\nWater-type moves.",
                "effect": "Changes the weather to sunshine for five turns, during which fire moves inflict 50% extra damage, and water moves inflict half damage.\n\nIf the user is holding heat rock, this effect lasts for eight turns.\n\nPokémon cannot become frozen.\n\nthunder has 50% accuracy.\n\nsolar beam skips its charge turn.\n\nmoonlight, morning sun, and synthesis heal 2/3 of the user's max HP.\n\nPokémon with chlorophyll have doubled original Speed.\n\nPokémon with forecast become fire.\n\nPokémon with leaf guard are not affected by major status effects.\n\nPokémon with flower gift change form; every Pokémon on their side of the field have their original Attack and Special Attack increased by 50%.\n\nPokémon with dry skin lose 1/8 max HP at the end of each turn.\n\nPokémon with solar power have their original Special Attack raised by 50% but lose 1/8 their max HP at the end of each turn.",
                "machine": "tm11"
            },
            {
                "id": 269,
                "name": "taunt",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The target is taunted into a rage that allows it to use\nonly attack moves for three turns.",
                "effect": "Target is forced to only use damaging moves for the next 3–5 turns, selected at random.  Moves that select other moves not known in advance do not count as damaging.\n\nassist, copycat, me first, metronome, mirror move, and sleep talk do not directly inflict damage and thus may not be used.\n\nbide, counter, endeavor, metal burst, and mirror coat are allowed.",
                "machine": "tm12"
            },
            {
                "id": 182,
                "name": "protect",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 4,
                "type": "normal",
                "damage_class": "status",
                "description": "This move enables the user to protect itself from\nall attacks. Its chance of failing rises if it is used\nin succession.",
                "effect": "No moves will hit the user for the remainder of this turn.  If the user is last to act this turn, this move will fail.\n\nIf the user successfully used detect, endure, protect, quick guard, or wide guard on the last turn, this move has a 50% chance to fail.\n\nlock on, mind reader, and no guard provide a (100 – accuracy)% chance for moves to break through this move.  This does not apply to one-hit KO moves (fissure, guillotine, horn drill, and sheer cold); those are always blocked by this move.\n\nthunder during rain dance and blizzard during hail have a 30% chance to break through this move.\n\nThe following effects are not prevented by this move:\n\n* acupressure from an ally\n* curse's curse effect\n* Delayed damage from doom desire and future sight; however, these moves will be prevented if they are used this turn\n* feint, which will also end this move's protection after it hits\n* imprison\n* perish song\n* shadow force\n* Moves that merely copy the user, such as transform or psych up\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm17"
            },
            {
                "id": 240,
                "name": "rain-dance",
                "power": null,
                "accuracy": null,
                "pp": 5,
                "priority": 0,
                "type": "water",
                "damage_class": "status",
                "description": "The user summons a heavy rain that falls for five\nturns, powering up Water-type moves. It lowers\nthe power of Fire-type moves.",
                "effect": "Changes the weather to rain for five turns, during which water moves inflict 50% extra damage, and fire moves inflict half damage.\n\nIf the user is holding damp rock, this effect lasts for eight turns.\n\nthunder has 100% accuracy.  If the target has used detect or protect, thunder has a (100 - accuracy)% chance to break through the protection.\n\nsolar beam has half power.\n\nmoonlight, morning sun, and synthesis heal only 1/4 of the user's max HP.\n\nPokémon with swift swim have doubled original Speed.\n\nPokémon with forecast become water.\n\nPokémon with dry skin heal 1/8 max HP, Pokémon with hydration are cured of major status effects, and Pokémon with rain dish heal 1/16 max HP at the end of each turn.",
                "machine": "tm18"
            },
            {
                "id": 218,
                "name": "frustration",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases inversely with happiness, given by `(255 - happiness) * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm21"
            },
            {
                "id": 216,
                "name": "return",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Inflicts regular damage.  Power increases with happiness, given by `happiness * 2 / 5`, to a maximum of 102.  Power bottoms out at 1.",
                "machine": "tm27"
            },
            {
                "id": 247,
                "name": "shadow-ball",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "ghost",
                "damage_class": "special",
                "description": "The user hurls a shadowy blob at the target.\nThis may also lower the target’s Sp. Def stat.",
                "effect": "Inflicts regular damage.  Has a 20% chance to lower the target's Special Defense by one stage.",
                "machine": "tm30"
            },
            {
                "id": 104,
                "name": "double-team",
                "power": null,
                "accuracy": null,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "By moving rapidly, the user makes illusory copies of\nitself to raise its evasiveness.",
                "effect": "Raises the user's evasion by one stage.",
                "machine": "tm32"
            },
            {
                "id": 332,
                "name": "aerial-ace",
                "power": 60,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "flying",
                "damage_class": "physical",
                "description": "The user confounds the target with speed, then\nslashes. This attack never misses.",
                "effect": "Inflicts regular damage.  Ignores accuracy and evasion modifiers.",
                "machine": "tm40"
            },
            {
                "id": 259,
                "name": "torment",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "The user torments and enrages the target, making it\nincapable of using the same move twice in a row.",
                "effect": "Prevents the target from attempting to use the same move twice in a row.  When the target leaves the field, this effect ends.\n\nIf the target is forced to attempt a repeated move due to choice band, choice scarf, choice specs, disable, encore, taunt, only having PP remaining for one move, or any other effect, the target will use struggle instead.  The target is then free to use the forced move next turn, as it didn't use that move this turn.",
                "machine": "tm41"
            },
            {
                "id": 263,
                "name": "facade",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "physical",
                "description": "This attack move doubles its power if the user is\npoisoned, burned, or paralyzed.",
                "effect": "Inflicts regular damage.  If the user is burned, paralyzed, or poisoned, this move has double power.",
                "machine": "tm42"
            },
            {
                "id": 156,
                "name": "rest",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "psychic",
                "damage_class": "status",
                "description": "The user goes to sleep for two turns. This fully\nrestores the user’s HP and heals any\nstatus conditions.",
                "effect": "User falls to sleep and immediately regains all its HP.  If the user has another major status effect, sleep will replace it.  The user will always wake up after two turns, or one turn with early bird.\n\nThis move fails if the Pokémon cannot fall asleep due to uproar, insomnia, or vital spirit.  It also fails if the Pokémon is at full health or is already asleep.",
                "machine": "tm44"
            },
            {
                "id": 213,
                "name": "attract",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "If it is the opposite gender of the user, the target\nbecomes infatuated and less likely to attack.",
                "effect": "Causes the target to fall in love with the user, giving it a 50% chance to do nothing each turn.  If the user and target are the same gender, or either is genderless, this move will fail.  If either Pokémon leaves the field, this effect ends.",
                "machine": "tm45"
            },
            {
                "id": 168,
                "name": "thief",
                "power": 60,
                "accuracy": 100,
                "pp": 25,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user attacks and steals the target’s held item\nsimultaneously. The user can’t steal anything if it\nalready holds an item.",
                "effect": "Inflicts regular damage.  If the target is holding an item and the user is not, the user will permanently take the item.  Damage is still inflicted if an item cannot be taken.\n\nPokémon with sticky hold or multitype are immune to the item theft effect.\n\nThe target cannot recover its item with recycle.\n\nThis move cannot be selected by assist or metronome.",
                "machine": "tm46"
            },
            {
                "id": 496,
                "name": "round",
                "power": 60,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "special",
                "description": "The user attacks the target with a song. Others can\njoin in the Round to increase the power of\nthe attack.",
                "effect": "Inflicts regular damage.  If round has already been used this turn, this move's power is doubled.  After this move is used, any other Pokémon using it this turn will immediately do so (in the order they would otherwise act), regardless of Speed or priority.  Pokémon using other moves will then continue to act as usual.",
                "machine": "tm48"
            },
            {
                "id": 374,
                "name": "fling",
                "power": null,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user flings its held item at the target to attack.\nThis move’s power and effects depend on the item.",
                "effect": "Inflicts regular damage.  Power and type are determined by the user's held item.  The item is consumed.  If the user is not holding an item, or its item has no set type and power, this move will fail.\n\nThis move ignores sticky hold.\n\nIf the user is under the effect of embargo, this move will fail.",
                "machine": "tm56"
            },
            {
                "id": 373,
                "name": "embargo",
                "power": null,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "status",
                "description": "This move can’t be used.\nIt’s recommended that this move is forgotten.\nOnce forgotten, this move can’t be remembered.",
                "effect": "Target cannot use its held item for five turns.  If the target leaves the field, this effect ends.\n\nIf a Pokémon under this effect uses bug bite or pluck on a Pokémon holding a berry, the berry is destroyed but not used.  If a Pokémon under this effect uses fling, it will fail.\n\nThis effect is passed by baton pass.",
                "machine": "tm63"
            },
            {
                "id": 371,
                "name": "payback",
                "power": 50,
                "accuracy": 100,
                "pp": 10,
                "priority": 0,
                "type": "dark",
                "damage_class": "physical",
                "description": "The user stores power, then attacks. If the user\nmoves after the target, this attack’s power will\nbe doubled.",
                "effect": "Inflicts regular damage.  If the target uses a move or switches out this turn before this move is used, this move has double power.",
                "machine": "tm66"
            },
            {
                "id": 14,
                "name": "swords-dance",
                "power": null,
                "accuracy": null,
                "pp": 20,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "A frenetic dance to uplift the fighting spirit.\nThis sharply raises the user’s Attack stat.",
                "effect": "Raises the user's Attack by two stages.",
                "machine": "tm75"
            },
            {
                "id": 244,
                "name": "psych-up",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user hypnotizes itself into copying any stat\nchange made by the target.",
                "effect": "Discards the user's stat changes and copies the target's.\n\nThis move cannot be copied by mirror move.",
                "machine": "tm77"
            },
            {
                "id": 447,
                "name": "grass-knot",
                "power": null,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "grass",
                "damage_class": "special",
                "description": "The user snares the target with grass and trips it.\nThe heavier the target, the greater the\nmove’s power.",
                "effect": "Inflicts regular damage.  Power increases with the target's weight in kilograms, to a maximum of 120.\n\nTarget's weight | Power\n--------------- | ----:\nUp to 10kg      |    20\nUp to 25kg      |    40\nUp to 50kg      |    60\nUp to 100kg     |    80\nUp to 200kg     |   100\nAbove 200kg     |   120\n",
                "machine": "tm86"
            },
            {
                "id": 207,
                "name": "swagger",
                "power": null,
                "accuracy": 85,
                "pp": 15,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user enrages and confuses the target. However,\nthis also sharply raises the target’s Attack stat.",
                "effect": "Raises the target's Attack by two stages, then confuses it.  If the target's Attack cannot be raised by two stages, the confusion is not applied.",
                "machine": "tm87"
            },
            {
                "id": 214,
                "name": "sleep-talk",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "While it is asleep, the user randomly uses one of the\nmoves it knows.",
                "effect": "Only usable if the user is sleeping.  Randomly selects and uses one of the user's other three moves.  Use of the selected move requires and costs 0 PP.\n\nThis move will not select assist, bide, bounce, chatter, copycat, dig, dive, fly, focus punch, me first, metronome, mirror move, shadow force, skull bash, sky attack, sky drop, sleep talk, solar beam, razor wind, or uproar.\n\nIf the selected move requires a recharge turn—i.e., one of blast burn, frenzy plant, giga impact, hydro cannon, hyper beam, roar of time, or rock wrecker—and the user is still sleeping next turn, then it's forced to use this move again and pay another PP for the recharge turn.\n\nThis move cannot be copied by mirror move, nor selected by assist, metronome, or sleep talk.",
                "machine": "tm88"
            },
            {
                "id": 369,
                "name": "u-turn",
                "power": 70,
                "accuracy": 100,
                "pp": 20,
                "priority": 0,
                "type": "bug",
                "damage_class": "physical",
                "description": "After making its attack, the user rushes back to\nswitch places with a party Pokémon in waiting.",
                "effect": "Inflicts regular damage, then the user immediately switches out, and the trainer selects a replacement Pokémon from the party.  If the target faints from this attack, the user's trainer selects the new Pokémon to send out first.  If the user is the last Pokémon in its party that can battle, it will not switch out.\n\nThe user may be hit by pursuit when it switches out, if it has been targeted and pursuit has not yet been used.\n\nThis move may be used even if the user is under the effect of ingrain.  ingrain's effect will end.",
                "machine": "tm89"
            },
            {
                "id": 164,
                "name": "substitute",
                "power": null,
                "accuracy": null,
                "pp": 10,
                "priority": 0,
                "type": "normal",
                "damage_class": "status",
                "description": "The user creates a substitute for itself using some of\nits HP. The substitute serves as the user’s decoy.",
                "effect": "Transfers 1/4 the user's max HP into a doll that absorbs damage and causes most negative move effects to fail.  If the user leaves the field, the doll will vanish.  If the user cannot pay the HP cost, this move will fail.\n\nThe doll takes damage as normal, using the user's stats and types, and will break when its HP reaches zero.  Self-inflicted damage from confusion or recoil is not absorbed.  Healing effects from opponents ignore the doll and heal the user as normal.  Moves that work based on the user's HP still do so; the doll's HP does not influence any move.\n\nThe doll will block major status effects, confusion, and flinching.  The effects of smelling salts and wake up slap do not trigger against a doll, even if the Pokémon behind the doll has the appropriate major status effect.  Multi-turn trapping moves like wrap will hit the doll for their regular damage, but the multi-turn trapping and damage effects will not activate.\n\nMoves blocked or damage absorbed by the doll do not count as hitting the user or inflicting damage for any effects that respond to such, e.g., avalanche, counter, or a rowap berry.  magic coat still works as normal, even against moves the doll would block.  Opposing Pokémon that damage the doll with a leech move like absorb are healed as normal.\n\nIt will also block acupressure, block, the curse effect of curse, dream eater, embargo, flatter, gastro acid, grudge, heal block, leech seed, lock on, mean look, mimic, mind reader, nightmare, pain split, psycho shift, spider web, sketch, swagger, switcheroo, trick, worry seed, and yawn.  A Pokémon affected by yawn before summoning the doll will still fall to sleep.\n\nThe doll blocks intimidate, but all other abilities act as though the doll did not exist.  If the user has an ability that absorbs moves of a certain type for HP (such as volt absorb absorbing thunder wave), such moves will not be blocked.\n\nlife orb and berries that cause confusion still work as normal, but their respective HP loss and confusion are absorbed/blocked by the doll.\n\nThe user is still vulnerable to damage inflicted when entering or leaving the field, such as by pursuit or spikes; however, the doll will block the poison effect of toxic spikes.\n\nThe doll is passed on by baton pass.  It keeps its existing HP, but uses the replacement Pokémon's stats and types for damage calculation.\n\nAll other effects work as normal.",
                "machine": "tm90"
            },
            {
                "id": 555,
                "name": "snarl",
                "power": 55,
                "accuracy": 95,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user yells as if it’s ranting about something,\nwhich lowers the Sp. Atk stats of opposing Pokémon.",
                "effect": "Inflicts regular damage.  Has a 100% chance to lower the target's Special Attack by one stage.",
                "machine": "tm95"
            },
            {
                "id": 399,
                "name": "dark-pulse",
                "power": 80,
                "accuracy": 100,
                "pp": 15,
                "priority": 0,
                "type": "dark",
                "damage_class": "special",
                "description": "The user releases a horrible aura imbued with dark\nthoughts. This may also make the target flinch.",
                "effect": "Inflicts regular damage.  Has a 20% chance to make the target flinch.",
                "machine": "tm97"
            }
        ]
    }
}